{
    "spells": [
        {
            "level": 2,
            "time": "1 action",
            "range": "25 feet",
            "description": "Your prayer calls down a divine blessing of toughness and resolve. Choose up to three creatures within range that are not currently affected by this spell. Each target's hit point maximum and current hit points increase by 5 for the duration. This spell has no effect upon undead or constructs. ",
            "name": "Aid",
            "duration": "8 hours",
            "school": "abjuration"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "5 feet",
            "description": "Choose a willing creature within range. Until the spell ends, the target can tread on air as if walking on solid ground. The target can move upward or downward at a 45 degree angle at half its speed. Treat strong winds (twenty miles per hour or more) as difficult terrain. falls if this spell is the only thing keeping it aloft. a spell slot of 5th level or higher, you can add one target for each level above 4th. ",
            "name": "Air Walk",
            "duration": "Concentration, up to 1 hour",
            "school": "transmutation"
        },
        {
            "level": 1,
            "time": "1 minute",
            "range": "25 feet",
            "description": "Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. Also, choose whether the alarm is mental or audible. If the spell ends while the target is airborne, it At Higher Levels: When you cast this spell using if you are within 1 mile of the warded area. This ping awakens you from sleep. bell for 10 seconds. Anyone within 50 feet of the warded area can hear the bell. Reduce the distance by 10 feet for each interposing closed door and by 20 feet for each interposing wall. of fine silver wire. ",
            "name": "Alarm",
            "duration": "8 hours",
            "school": "abjuration (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "25 feet",
            "description": "This spell lets you show an animal or similar beast that you mean it no harm. Choose a beast within range that can see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you until the spell ends. If you or one of your companions harms the target, the spells ends early. animal likes. ",
            "name": "Animal Friendship",
            "duration": "24 hours",
            "school": "enchantment"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "25 feet",
            "description": "By means of this spell, you can use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as \"a man or woman dressed in the uniform of the town guard\" or \"a red-haired dwarf.\" You also speak a message of up to 25 words. The target beast travels as fast as it can to the specified location. When the animal arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. A mental alarm alerts you with a psychic ping An audible alarm produces the sound of a hand Material Components: A tiny bell and a piece Material Components: A morsel of food the before the spell ends, the message is lost. animal likes. ",
            "name": "Animal Messenger",
            "duration": "8 hours",
            "school": "transmutation (ritual)"
        },
        {
            "level": 3,
            "time": "1 minute",
            "range": "10 feet",
            "description": "Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature's game statistics). hours, after which it stops obeying any command you have given it. As part of your action, you can mentally command any creature you made with this spell if the creature is within 50 feet of you. You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. 24 hours, you must cast this spell on the creature before the current 24-hour period ends. This use of the spell reasserts your control over the creature, rather than animating a new creature. evil casters use this spell frequently. a spell slot of 4th level or higher, you create or reassert control over one additional undead creature for each level above 3rd. Each of the creatures must come from a different corpse or pile of bones. piece of flesh, and a pinch of bone dust. ",
            "name": "Animate Dead",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "Self",
            "description": "If the messenger does not reach its destination Material Components: A morsel of food the The creature is under your control for 24 To maintain control of the creature for another Animating the dead is not a good act, and only At Higher Levels: When you cast this spell using Material Components: A drop of blood, a A 10-foot-radius invisible cloud of antimagic surrounds you. This area is divorced from the weave of magical energy that suffuses the multiverse. Within the cloud, spells fizzle out, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the cloud moves with you, centered on you. artifact or a deity, are suppressed in the cloud and cannot protrude into it. While an effect is suppressed, it does not function, but the time it spends suppressed counts against its duration. effects, such as magic missile and charm person, that target a creature or an object in the cloud have no effect on that target. magical effect, such as fireball, cannot extend into the cloud, and if the cloud overlaps an area of magic, the part of that area that is covered by the cloud is suppressed. For example, the flames created by a wall of fire are suppressed within the cloud, creating a gap in the wall if the overlap is large enough. magical effect on a creature or an object in the cloud is suppressed while the creature or object is in it. magic items are suppressed in the cloud. For example, a +1 long sword in the cloud functions as a nonmagical long sword. suppressed if it is used against a target in the cloud or wielded by an attacker in the cloud. If a magic weapon or a piece of magic ammunition fully leaves the cloud (for example, if you fire a magic arrow or throw a magic spear at a target outside the cloud), the magic of the item ceases to be suppressed as soon as it exits. the cloud, whether the cloud is the destination or the departure point for such magical travel. A portal to another world or plane of existence, as well as an opening to an extradimensional space, such as that created by a rope trick spell, temporarily closes while in the cloud. by magic temporarily winks out of existence in the cloud. Such a creature instantly reappears Magical effects, except those created by an Targeted Effects: Spells and other magical Areas of Magic: The area of another spell or Magic on Creatures and Objects: Any active Magic Items: The properties and powers of A magic weapon's properties and powers are Magical Travel: Teleportation fails to work in Summoned Creatures: A creature summoned once the space the creature occupied is no longer within the cloud. dispel magic and greater dispel magic have no effect on the cloud. Likewise, the clouds created by different antimagic fields do not nullify each other. iron or iron filings. ",
            "name": "Antimagic Field",
            "duration": "Concentration, up to 1 hour",
            "school": "abjuration"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "25 feet",
            "description": "You create an invisible, magical eye within range that hovers in the air for the duration. the eye, which has normal vision and darkvision out to 10 feet. The eye can look in every direction. feet in any direction. There is no limit to how far away from you the eye can move, but it cannot enter another plane of existence. A solid barrier blocks the eye's movement, but the eye can pass through an opening as small as 1 inch in diameter. ",
            "name": "Arcane Eye",
            "duration": "Concentration, up to 1 hour",
            "school": "divination"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "500 feet",
            "description": "Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. The portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. The portals remain open for the duration. exits from the other portal as if the two were adjacent to each other. The mist that fills each portal prevents vision through it. Dispel Magic: Spells and magical effects such as Material Components: A pinch of powdered You mentally receive visual information from As an action, you can move the eye up to 30 Material Components: A bit of bat fur. Any creature or object entering one portal ",
            "name": "Arcane Gate",
            "duration": "Concentration, up to 10 minutes",
            "school": "conjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "Touch a door, window, gate, chest, or other entryway that is closed. The chosen object is locked for the duration. You and the creatures you designate when you cast this spell can open the object normally. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting knock on the object suppresses arcane lock for 10 minutes. difficult to break; the DC to break it increases by 10. least 25 gp ",
            "name": "Arcane Lock",
            "duration": "Permanent",
            "school": "abjuration"
        },
        {
            "level": 9,
            "time": "1 hour",
            "range": "10 feet",
            "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane. The material body you leave behind is unconscious and in a state of suspended animation; it does not need food or air and does not age. in almost every way, replicating your game statistics and possessions. The principal difference is the addition of a silvery cord that extends out from between your shoulder blades and trails behind you, fading to invisibility after 1 foot. This cord is your tether to your material body. As long as the tether remains intact, you can find your way home. If the cord is cut- something that can happen only when an effect specifically states that it does-your soul and body are separated, killing you instantly. Astral Plane and can pass through portals there leading to any other plane. If you enter a new plane, your astral form disappears, and you gain a body capable of surviving on the plane you While affected by this spell, the object is more Material Components: Gold dust worth at Your astral body resembles your mortal form Your astral form can freely travel through the visit. Your game statistics do not change. If you return to the Astral Plane by casting this spell again, or by some other means, the body created for the plane you visited disappears, and your astral body reappears. when you use your action to end it. When the spell ends, the affected creature returns to its physical body, and it awakens. or one of your companions. A successful dispel magic or greater dispel magic used against an astral or physical body ends the spell for that creature. And if a creature's second body or its astral form is reduced to 0 hit points, the spell ends for that creature. The silver cord returns to the creature's body where it rests, reviving it from its state of suspended animation. your companions remain in their astral forms and must find their own way back to their bodies, usually by dropping to 0 hit points. will affect with this spell, you must provide a jacinth worth at least 1,000 gp and one ornately carved bar of silver worth at least 100 gp. ",
            "name": "Astral Projection",
            "duration": "Permanent",
            "school": "necromancy"
        },
        {
            "level": 2,
            "time": "1 minute",
            "range": "Self",
            "description": "Describe a course of action that you plan to take within the next 30 minutes. By casting gem- inlaid sticks, rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an answer from an otherworldly entity about the results of that course of action. The DM chooses from the following possible answers: The spell does not take into account any possible circumstances that might change the outcome, The spell ends for you and your companions The spell might also end prematurely for you If you are returned to your body prematurely, Material Components: For each creature you good or bad such as the casting of additional spells or the loss or gain of a companion. completing your next long rest, there is a 25 percent chance on each casting after the first that you get a false reading. The DM makes this roll in secret. sticks, bones, or similar tokens worth at least 25 gp, which are not consumed when you cast the spell. ",
            "name": "Augury",
            "duration": "Instantaneous",
            "school": "divination (ritual)"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Self",
            "description": "An aura of invisibility surrounds you to a distance of 10 feet. You and the creatures you designate in the area become invisible for 1 hour. The spell ends for an affected creature that attacks, casts a spell that affects an enemy creature, or moves more than 10 feet away from you. The spell ends for all affected creatures if you attack or cast a spell that affects an enemy creature, or if you use your action to end it. a bit of gum arabic. ",
            "name": "Aura of Invisibility",
            "duration": "1 hour",
            "school": "illusion"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "Self",
            "description": "The power of life radiates out from you, protecting friendly creatures within 25 feet of you from death's hold. For the duration, each friendly creature in the area, including you, has resistance to necrotic damage, and its hit point maximum can't be reduced. In addition, whenever a friendly creature with 0 hit points starts its turn in the area, it regains 1 hit point. ",
            "name": "Aura of Life",
            "duration": "Concentration, up to 10 minutes",
            "school": "abjuration"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "Self",
            "description": "If you cast the spell two or more times before Material Components: Specially marked Material Components: An eyelash encased in Holy energy radiates out from you, protecting friendly creatures within 25 feet of you from bodily corruption. For the duration, each friendly creature in the area, including you, cannot become diseased, has resistance to poison damage, and has advantage on all saving throws against harmful conditions. ",
            "name": "Aura of Purity",
            "duration": "Concentration, up to 10 minutes",
            "school": "abjuration"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Self",
            "description": "Healing power links you to friendly creatures within 10 feet of you, and with each strike you land on a foe, your allies receive a surge of vitality. For the duration, once on each of your turns when you deal damage to a hostile creature, each friendly creature in the area, including you, regains 1d6 hit points. ",
            "name": "Aura of Vitality",
            "duration": "Concentration, up to 1 minute",
            "school": "evocation"
        },
        {
            "level": 5,
            "time": "8 hours",
            "range": "Touch",
            "description": "After spending the casting time tracing magical pathways within a precious gemstone, touch a Large or smaller beast or plant. The target must have either no Intelligence score or an Intelligence of 2 or less. The target permanently gains an Intelligence of 10. The target also gains the ability to speak one language you know. If the target is a plant, it gains the ability to move its limbs, roots, vines, creepers, and so forth, and it gains senses similar to a human's. Your DM chooses statistics appropriate for the awakened plant. you for 30 days or until you or your companions do anything harmful to it. When the charmed condition ends, the awakened creature chooses whether to remain friendly to you, based on how you treated it while it was charmed. agate worth at least 1,000 gp. The awakened beast or plant is charmed by Material Components: You must provide an ",
            "name": "Awaken",
            "duration": "Instantaneous",
            "school": "transmutation"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose one celestial, elemental, or fiend within range that is not on its plane of origin. That creature must make a Charisma saving throw as you adjure it to depart. On a failed save, the creature instantly returns to its plane of origin, disappearing with a faint pop. If the creature succeeds on the saving throw, it is still repulsed by you, which gives it disadvantage on any attacks it makes against you before the end of its next turn. presenting items the creature hates, fears, or otherwise opposes. For each such item you present, the DM might increase the DC by 1 or more. distasteful to the target. ",
            "name": "Banishment",
            "duration": "Instantaneous",
            "school": "abjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "Touch a willing creature. The creature's skin takes on a rough, bark-like appearance and becomes as tough as word, giving the creature a +2 bonus to AC for the duration. ",
            "name": "Barkskin",
            "duration": "Concentration, up to 1 hour",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose any number of creatures within range. Your prayer fills these creatures with hope, vitality, and the will to push through the most trying circumstances. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and a target regains the maximum number of hit points possible from any healing. You can increase the saving throw DC by Material Components: Any item that is ",
            "name": "Beacon of Hope",
            "duration": "1 minute",
            "school": "abjuration"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create a vertical wall of whirling, razor- sharp blades made of magical force. The wall appears within range and lasts for the duration. You can choose to make the wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover to creatures behind it, and its space is difficult terrain. starts its turn there must make a Dexterity saving throw. On a failed save, the creature takes 6d10 slashing damage. On a successful save, the creature takes half as much damage, and unless it can't take actions, it can move 5 feet so it is not in the wall. ",
            "name": "Blade Barrier",
            "duration": "Concentration, up to 10 minutes",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose any number of creatures within range that are not already affected by this spell. Whenever a target makes an attack roll or a saving throw before the spell ends, your blessing allows it to add a d4 to the result. ",
            "name": "Bless",
            "duration": "Concentration, up to 10 minutes",
            "school": "enchantment"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "10 feet",
            "description": "Choose a creature within range that you can see. Necromantic energy washes over that creature, draining moisture and vitality from its body. The creature must make a Constitution saving throw. The creature takes 8d8 necrotic damage on a failed save, and half as much damage on a successful one. This spell has no effect upon undead or constructs. Any creature that enters the wall's area or it makes the saving throw with disadvantage, and the spell deals maximum damage to it. creature, such as a tree or shrub, it does not make a saving throw; it simply withers and dies. a spell slot of 5th level or higher, you deal 1d8 extra necrotic damage for each level above 4th. ",
            "name": "Blight",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Self, but only if you are not on the",
            "description": "Roll a d20 at the end of each of your turns before the spell ends. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane. At the start of your next turn, you return in a space of your choice within 10 feet of the space you vanished from. planes, you can affect and be affected only by creatures and objects on the Ethereal Plane while you are there. another 1, you are lost in the Ethereal Plane for 2d6 hours. At the end of that time, you reappear as described above. ",
            "name": "Blink",
            "duration": "1 minute",
            "school": "transmutation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Self",
            "description": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with blindsight, or can see through illusions, as with the true seeing spell. ",
            "name": "Blur",
            "duration": "Concentration, up to 10 minutes",
            "school": "illusion"
        },
        {
            "level": 2,
            "time": "Swift",
            "range": "Self",
            "description": "If you target a plant creature or a magical plant, If you target a nonmagical plant that is not a At Higher Levels: When you cast this spell using Ethereal Plane Unless you have magic that can reach across If you roll a 1 on the d20, roll again. If you roll You can cast this spell when you hit with a melee weapon attack on your turn. you strike, the light leaping toward your foe, and the attack deals 2d6 extra radiant damage to the target. If the target is invisible, it becomes visible. The target also emits dim light in a 5-foot radius and cannot become invisible until the spell ends. a spell slot of 3rd level or higher, the extra damage increases by 1d6 for each level above 2nd. ",
            "name": "Branding Smite",
            "duration": "1 minute",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, and half as much damage on a successful one. area that are not being worn or carried. a spell slot of 2nd level or higher, the damage increases by 1d6 for each level above 1st. ",
            "name": "Burning Hands",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "50 feet",
            "description": "A roiling stormcloud appears over your head, flashing with lightning. When you cast the spell, choose a point you can see within range. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a Dexterity saving throw. A creature takes 4d10 lightning damage on a failed save, and half as much damage on a successful one. Your weapon gleams with astral radiance as At Higher Levels: When you cast this spell using The fire ignites any flammable objects in the At Higher Levels: When you cast this spell using call down another lightning strike from the cloud. you cast this spell, the spell gives you control over the existing storm instead of creating a new one. When you call down a bolt of lightning from the storm, it deals 6d10 damage. a spell slot of 4th or higher level, the damage increases by 1d10 for each level above 3rd. ",
            "name": "Call Lightning",
            "duration": "Concentration, up to 10 minutes",
            "school": "conjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "10 feet",
            "description": "You create a phantasmal image of sheer terror in the minds of your enemies. Each creature of your choice within range must succeed on a Wisdom saving throw or be frightened for the duration. This spell has no effect upon undead or constructs. use its action to make a Wisdom check against your spell save DC. If the creature succeeds on the check, it is no longer affected by the spell. ",
            "name": "Cause Fear",
            "duration": "1 minute",
            "school": "illusion"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create a bolt of lightning that strikes a target you choose within range. Three bolts then leap from that target to as many as three secondary targets, each of which must be within 25 feet of the primary target. Divide the three bolts among the potential secondary targets as you wish. A secondary target can be a creature or an object, and one target can be struck by only one of the bolts. must make a Dexterity saving throw. The target takes 10d6 lightning damage on a failed save, and half as much damage on a successful one. amber, glass, or a crystal rod; plus three silver pins. Until the spell ends, you can use your action to If you are outdoors in stormy conditions when At Higher Levels: When you cast this spell using On its turn, a creature affected by this spell can For each bolt that strikes a target, that target Material Components: A bit of fur; a piece of ",
            "name": "Chain Lightning",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose a living humanoid within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. ",
            "name": "Charm Person",
            "duration": "1 hour",
            "school": "enchantment"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "Touch",
            "description": "Make a melee attack roll to touch a creature and assail its life force with the chill of the grave. You have a bonus to the roll equal to your magic ability modifier + your spellcasting bonus, if any. On a hit, the target takes 1d8 necrotic damage, and it cannot regain hit points until the start of your next turn. This spell has no effect upon undead or constructs. by 1d8 when you reach a caster level of 5th (2d8), 10th (3d8), 15th (4d8), and 20th (5d8). ",
            "name": "Chill Touch",
            "duration": "1 round",
            "school": "Necromancy"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a point within range that you can see. A wave of raw negative energy washes out from that point to a distance of 50 feet, threatening to snuff the life force of creatures it touches. Each creature in that area must make a Constitution saving throw. The creature takes 10d6 necrotic damage on a failed save, or half as much damage on a successful one. This spell has no effect upon undead or constructs. At Higher Levels: The spell's damage increases crushed black pearl worth at least 500 gp. ",
            "name": "Circle of Death",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "Self",
            "description": "Divine energy radiates out from you, distorting and diffusing magical energy within 25 feet of your. For the duration, each friendly creature in the area, including you, has advantage on saving throws against spells and other magical effects. ",
            "name": "Circle of Power",
            "duration": "Concentration, up to 10 minutes",
            "school": "abjuration"
        },
        {
            "level": 8,
            "time": "1 hour",
            "range": "5 feet",
            "description": "This spell grows an inert duplicate of a living creature as a safeguard against death. You must have a tiny portion (at least a cubic inch) of its flesh within range. This clone forms inside a sealed vessel and grows to full size and maturity after 120 days. It remains inert and endures indefinitely, as long as its vessel remains undisturbed. original creature dies, the creature's soul transfers to the clone, provided that the soul is free and willing to return. The clone is physically identical with the original and has the same personality, memories, and abilities, but none of the original's equipment. The original creature's physical remains, if they still exist, become inert and cannot thereafter be restored to life, since the creature's soul is elsewhere. least 1,000 gp. In addition, you must provide a vessel worth at least 2,000 gp that has a sealable lid and is large enough to hold a Medium creature. This might be a huge urn, an elaborate coffin, a mud-filled cyst in the ground, or an elaborate crystal container filled with salt water, for example. It is not consumed when you cast the spell. Material Components: The powder of a At any time after the clone matures, if the Material Components: A diamond worth at ",
            "name": "Clone",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a point within range. You create a 20- foot-radius cloud of poisonous, yellow-green fog centered there. It lasts for the duration, and its area is heavily obscured. must make a Constitution saving throw. A creature takes 6d8 poison damage on a failed save, and half as much damage on a successful one. A creature must also make this saving throw when it enters the cloud or ends its turn there. Undead and constructs take no damage from the cloud. start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings. a spell slot of 6th level or higher, the damage increases by 1d8 for each level above 5th. ",
            "name": "Cloudkill",
            "duration": "Concentration, up to 10 minutes",
            "school": "conjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "A dazzling array of flashing, colored light springs from your hand. Each creature in a 15-foot cone must make a Wisdom saving throw, provided the creature can see. For every creature that fails its saving throw, roll a d6 to determine the spell's effect on that creature. When the cloud appears, each creature in it The cloud moves 10 feet away from you at the At Higher Levels: When you cast this spell using powder or sand that is colored red, yellow, and blue. ",
            "name": "Color Spray",
            "duration": "1 round",
            "school": "illusion"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "50 feet",
            "description": "You speak a one-word command to a creature within range. It must succeed on a Wisdom saving throw or follow the command on its next turn, unless the creature doesn't understand it. This spell has no effect upon undead or constructs. follow. You might issue a command other than one described here. If you do so, the DM determines how the target behaves. If the target is prevented from following the command issued to it, the spell ends. shortest and most direct route, ending its turn if it moves within 5 feet of you. and then ends its turn. from you by the fastest available means. turn. actions. A flying creature stays aloft, provided it is able to do so. ",
            "name": "Command",
            "duration": "1 round",
            "school": "enchantment"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "Self",
            "description": "You contact your deity, or a divine proxy, and ask up to three questions that can be answered with a yes or a no. You must ask your questions before the spell ends. You receive a correct answer for each question. necessarily omniscient, so you might receive \"unclear\" as an answer if a question pertains to information that lies beyond the deity's Material Components: A pinch each of Some typical commands and their effects Approach: The target moves toward you by the Drop: The target drops whatever it is holding Flee: The target spends its turn moving away Grovel: The target falls prone and then ends its Halt: The target does not move and takes no Divine beings of the Outer Planes are not knowledge. In a case where a one-word answer could be misleading or contrary to the deity's interests, the DM might offer a short phrase as answer instead. completing your next long rest, there is a 25 percent chance on each casting after the first that you get no answer. The DM makes this roll in secret. holy or unholy water. ",
            "name": "Commune",
            "duration": "1 minute",
            "school": "divination (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "For the duration, you understand the literal meaning of spoken language that you hear and of written language that you can see, provided you are touching the surface on which the words are written. It takes about 1 minute to read one page of text. are concealed in a text, and it does not allow you to read magical writing or inscriptions, such as those deciphered by the read magic spell. few grains of salt. ",
            "name": "Comprehend Languages",
            "duration": "1 hour",
            "school": "divination (ritual)"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "Self",
            "description": "A blast of cold air erupts from your hands. Each creature in a 60-foot cone must make a Constitution saving throw. A creature takes 6d8 cold damage on a failed save, and half as much damage on a successful one. statue until it thaws. a spell slot of 6th level or higher, the damage increases by 1d8 for each level above 5th. glass cone. If you cast the spell two or more times before Material Components: Incense and a vial of This spell does not reveal secret messages that Material Components: A pinch of soot and a A creature killed by this spell becomes a frozen At Higher Levels: When you cast this spell using Material Components: A very small crystal or ",
            "name": "Cone of Cold",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "100 feet",
            "description": "This spell assaults and twists creatures' minds, spawning delusions and provoking uncontrolled action. Each creature in a 10-foot-radius cloud centered on a point you choose within range must succeed on a Wisdom saving throw or be affected by the spell for the duration. at the start of each of its turns to determine its behavior during that turn. ",
            "name": "Confusion",
            "duration": "Concentration, up to 1 minute",
            "school": "enchantment"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Self",
            "description": "You throw a weapon or fire a piece of ammunition into the air to create a cone of identical weapons that barrage your enemies. Each creature in a 60-foot cone must succeed on a Dexterity saving throw or take 3d8 damage (half damage on a successful save). The damage type is the same as that of the weapon or ammunition used as a component. ammunition or a thrown weapon. If you use a A creature affected by this spell must roll a d10 Material Components: Three nut shells. Material Components: One piece of thrown weapon, it is not consumed when you cast the spell. ",
            "name": "Conjure Barrage",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "100 feet",
            "description": "You fire a piece of ammunition from a ranged weapon into the air, and choose a point within range. Hundreds of duplicates of the piece of ammunition fall in a massive volley from above. Each creature in a 40-foot-radius, 20-foot-high cylinder centered on that point must make a Dexterity saving throw. A creature takes 8d8 damage on a failed save, and half as much damage on a successful one. The damage type is the same as that of the ammunition used as a component. ammunition for a ranged weapon. ",
            "name": "Conjure Volley",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 5,
            "time": "1 minute",
            "range": "Self",
            "description": "You mentally contact a demigod, the spirit of a long-dead sage, or some other, mysterious entity from another plane. You can ask it up to five questions that can be answered with a single word. You must ask your questions before the spell ends. such as \"yes,\" \"no,\" \"maybe,\" \"never,\" \"irrelevant,\" or \"unclear\" (if the entity doesn't know the answer to the question). If a one-word answer would be misleading, the DM might instead offer a short phrase as an answer. strain or even break your mind. When you receive the answer to each question, make an Intelligence or a Charisma check (your choice). The DC for the first question is 5, and the DC increases by 5 for each subsequent question. If you fail the check, you take 6d6 psychic damage, the spell ends, and you can't cast spells until you complete a long rest. Material Components: One piece of The DM answers each question with one word, Contacting this extraplanar intelligence can ",
            "name": "Contact Other Plane",
            "duration": "1 minute",
            "school": "divination (ritual)"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "5 feet",
            "description": "You plant four arrows or crossbow bolts in the ground around you while laying a spell upon them to protect you. Until the spell ends, each time a creature moves to within 5 feet of you, one of the bolts or arrows flies up to strike at it and is then destroyed. The creature must make a Dexterity saving throw or take 1d6 piercing damage. When no bolts or arrows remain, the spell ends. a spell slot of 3rd level or higher, the number of bolts or arrows increases by one for each level above 2nd. or bolts. ",
            "name": "Cordon of Arrows",
            "duration": "1 minute",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "25 feet",
            "description": "You create 30 pounds of food and 20 gallons of water within range, enough to sustain up to ten humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and does not go bad. ",
            "name": "Create Food and Water",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "25 feet",
            "description": "You either create or destroy water. clean water within range in an open container. Alternatively, the water falls as rain in a 25-foot cube within range, extinguishing exposed flames in the area. At Higher Levels: When you cast this spell using Material Components: Four or more arrows Create Water: You create up to 2 gallons of water to sustain one Small or Medium creature for 24 hours. water in an open container within range. Alternatively, you destroy fog in a 25-foot cube within range. a spell slot of 2nd level or higher, you create or destroy 2 additional gallons of water for each level above 1st. creating water or a few grains of sand if destroying it. ",
            "name": "Create or Destroy Water",
            "duration": "Instantaneous",
            "school": "transmutation"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "500 feet",
            "description": "A swarm of spiders, ants, and centipedes covers the ground in a 50-foot-radius cloud centered on a point you can see within range. The swarm remains for the duration, biting and stinging everything in its path. must make a Constitution saving throw. A creature takes 4d6 piercing damage and 4d6 poison damage on a failed save, and half as much damage on a successful one. A creature also must make this saving throw if it ends its turn in the swarm or if it moves through it, but not more than once per turn. can move the swarm up to 20 feet. ",
            "name": "Creeping Doom",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Self",
            "description": "Holy power radiates from you, awakening boldness in friendly creatures within 25 feet of you. For the duration, each friendly creature in the area, including you, deals 1d8 extra radiant damage with weapon attacks that hit. The spell produces enough clean, drinkable Destroy Water: You destroy up to 2 gallons of At Higher Levels: When you cast this spell using Material Components: A drop of water if When the swarm appears, each creature in it On each of your turns until the spell ends, you ",
            "name": "Crusader's Mantle",
            "duration": "Concentration, up to 10 minutes",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a creature, channeling positive energy into it. The creature regains 2d8 + 2 hit points. This spell has no effect upon undead or constructs. a spell slot of 2nd level or higher, the healing increases by 2d8 for each level above 1st. ",
            "name": "Cure Wounds",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 5,
            "time": "Swift",
            "range": "Self",
            "description": "You can cast this spell when you hit with a melee weapon attack on your turn. Your weapon crackles with purifying flame, and the attack deals 5d10 extra fire damage to the target. Additionally, if this attack reduces the creature to 50 hit points or fewer, the creature is banished to a location of the Dungeon Master's choosing in the Nine Hells. ",
            "name": "Damning Smite",
            "duration": "1 minute",
            "school": "abjuration"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "200 feet",
            "description": "You create up to four lights within range, making them appear as torches, lanterns, or glowing orbs. You can also combine the four lights into one glowing, vaguely humanoid form. Whichever form you choose, the lights shed dim light in a radius up to 30 feet. feet to a new spot within range. No two of the lights can be more than 20 feet apart, and a light winks out if it exceeds the spell's range. ",
            "name": "Dancing Lights",
            "duration": "Concentration, up to 1 minute",
            "school": "Evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "At Higher Levels: When you cast this spell using On your turn, you can move the lights up to 50 You touch an object you are holding or one that is not being worn or carried. Magical darkness spreads from the object to fill a 15-foot-radius sphere for the duration. Not even a creature with darkvision can see through this darkness, and no natural light can illuminate it. object, such as a bowl or a helm, blocks the darkness. of light created by a spell of 2nd level or lower, the entire area of light is dispelled. piece of coal. ",
            "name": "Darkness",
            "duration": "Concentration, up to 10 minutes",
            "school": "evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a willing creature. For the duration, that creature has darkvision with a range of 60 feet. carrot or an agate. ",
            "name": "Darkvision",
            "duration": "8 hours",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch an object you are holding or one that is not being worn or carried. For the duration, the object emits bright light in a 120-foot-radius sphere and dim light for an additional 120 feet. object, such as a bowl or a helm, blocks the glow. of darkness created by a spell of 3rd level or lower, the entire area of darkness is dispelled. ",
            "name": "Daylight",
            "duration": "1 hour",
            "school": "evocation"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "Touch",
            "description": "Covering the affected object with an opaque If any of this spell's area overlaps with an area Material Components: A drop of pitch or a Material Components: Either a pinch of dried Covering the affected object with an opaque If any of this spell's area overlaps with an area You touch a creature. Until the spell ends, the first time the target is subjected to an effect that would kill it outright without dealing damage, that effect is instead negated against the target, and the spell ends. Or the first time the target drops to 0 hit points because of damage, the target instead drops to 1 hit point, and the spell ends. constructs. ",
            "name": "Death Ward",
            "duration": "8 hours",
            "school": "abjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "25 feet",
            "description": "One creature you choose within range must make a Wisdom saving throw. On a failed save, the creature is drawn to you, compelled by your divine demand. For the duration, it has disadvantage on attack rolls against creatures other than you, and it cannot willingly move more than 25 feet away from you. If you attack any other creature, or if you end your turn more than 25 feet away from the target, the spell ends. ",
            "name": "Demand",
            "duration": "1 minute",
            "school": "enchantment"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a creature within range that you can see. The target must make a Constitution saving throw as your words threaten to unmake its very existence. The target takes 15d6 necrotic damage on a failed save, or half as much damage on a successful one. If this damage reduces the target to 0 hit points, it dies, and the spell consumes its remains utterly, leaving behind only clothing and other possessions. A creature killed by this spell cannot be restored to life by any means short of a true resurrection or a wish spell. holy symbol worth at least 500 gp, which is not consumed when you cast the spell. This spell has no effect upon undead or Material Components: You must have a silver ",
            "name": "Destruction",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "For the duration, you detect the presence of any celestial, fiend, or undead creature within 25 feet of you, and such creatures cannot become hidden from you. Within the same radius, you detect the presence of any place or object that has been consecrated or desecrated by magic. blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt. ",
            "name": "Detect Good and Evil",
            "duration": "Concentration, up to 10 minutes",
            "school": "divination (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "For the duration, you sense the presence of magic within 25 feet of you. If you sense magic, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any. blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt. ",
            "name": "Detect Magic",
            "duration": "Concentration, up to 10 minutes",
            "school": "divination (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "For the duration, if there is poison, a poisonous creature, or a disease within 25 feet of you, you know it, where the poison or disease is, and what kind of poison, poisonous creature, or disease is present. blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt. The spell can penetrate most barriers, but it is The spell can penetrate most barriers, but it is The spell can penetrate most barriers, but it is ",
            "name": "Detect Poison and Disease",
            "duration": "Concentration, up to 10 minutes",
            "school": "divination (ritual)"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "500 feet",
            "description": "You teleport yourself from your current location to any other spot within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"upward to the northwest at a 45-degree angle, 300 feet.\" weight doesn't exceed what you can carry. You can also bring one willing creature of your size or smaller carrying gear up to its maximum load. The creature must be within 5 feet of you when you cast this spell. by an object or a creature, you and any creature traveling with you each take 4d6 force damage, and the spell is lost but fails to teleport you. ",
            "name": "Dimension Door",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "You make yourself-including your clothing, armor, weapons, and equipment-look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into something while it was seemingly still in midair. You can bring along objects as long as their If you would arrive in a place already occupied The changes wrought by this spell fail to hold can use its action to inspect your appearance and must succeed on a Wisdom check against your spellcasting DC. ",
            "name": "Disguise Self",
            "duration": "1 hour",
            "school": "illusion"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "50 feet",
            "description": "A thin green ray springs from your pointing finger to a target within range that you can see. The target can be a creature, an object other than a magic item, or a creation of magical force, such as the wall created by wall of force. Dexterity saving throw. On a failed save, the ray strikes the target. If the target has 60 hit points or fewer, it is disintegrated. Otherwise, it takes 17d6 force damage. If this damage reduces the target to 0 hit points, it is disintegrated. wears or carries are reduced to a pile of fine gray dust. It can be restored to life only by means of a true resurrection or a wish spell. magical force targeted by this spell is automatically disintegrated. If the target is a Huge or larger object or creation of force, this spell disintegrates a 10-foot-cube portion of it. pinch of dust. ",
            "name": "Disintegrate",
            "duration": "Instantaneous",
            "school": "transmutation"
        },
        {
            "level": 5,
            "time": "Swift",
            "range": "Self",
            "description": "You can cast this spell when you hit with a melee weapon attack on your turn. A pulse of green light flashes from your weapon, and the attack deals 5d10 extra force damage to the target. Additionally, the target must make a Constitution saving throw or take 2d10 force damage at the start of each of its turns until the spell ends. The spell ends when the target makes a successful saving throw against it. If the target To discern that you are disguised, a creature A creature targeted by this spell must make a A disintegrated creature and everything it A Large or smaller object or creation of Material Components: A lodestone and a is reduced to 0 hit points by this spell, the target is disintegrated. ",
            "name": "Disintegrating Smite",
            "duration": "1 minute",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose one creature, object, or magical effect within range. Any spell of 2nd level or lower on the target ends. For each spell of 3rd level or higher on the target, make an ability check using your magic ability. The DC equals 10 + the spell's level. On a successful check, the spell ends. ",
            "name": "Dispel Magic",
            "duration": "Instantaneous",
            "school": "abjuration"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "Self",
            "description": "Your prayer and offering put you in contact with your god or the god's servants. Ask a single question concerning a specific goal, event, or activity to occur within 1 week. The DM offers a truthful reply. The reply might be a short phrase, a cryptic rhyme, or an omen. possible circumstances that might change the outcome, such as the casting of additional spells or the loss or gain of a companion. answers. The first time you cast it, you can receive a reliable answer based on your query. If you cast the spell two or more times before completing your next long rest, there is a 25 percent chance on each casting after the first that you get a false reading. The DM makes this roll in secret. sacrificial offering appropriate to your religion, together worth at least 25 gp. ",
            "name": "Divination",
            "duration": "Instantaneous",
            "school": "divination (ritual)"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "Self",
            "description": "The spell does not take into account any This spell contacts otherworldly entities for Material Components: Incense and a Your prayer empowers you and your weapon with divine radiance. Until the spell ends, your weapon attacks deal 1d8 extra radiant damage on a hit. ",
            "name": "Divine Favor",
            "duration": "Concentration, up to 10 minutes",
            "school": "evocation"
        },
        {
            "level": 4,
            "time": "Swift",
            "range": "Self",
            "description": "Intoning a prayer fills you with unearthly might. For the duration, you gain a +4 bonus to Strength checks and Strength-based attack rolls and damage rolls. ",
            "name": "Divine Power",
            "duration": "Concentration, up to 10 minutes",
            "school": "transmutation"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a beast within range that you can see. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or your companions are fighting it, it has advantage on the saving throw. The charmed target can't take reactions, and you have a telepathic link with it while the two of you are on the same plane of existence. actions and where it moves by commanding it telepathically. Doing so requires no action on your part, but you must be able to take actions. If you give the target no commands, it does nothing other than what it needs to survive, such as moving away from a threat. to you through the telepathic link, and you can use your action to gain an awareness of the target's surroundings until the start of your next turn, as interpreted by the target's senses. the spell if you or your companions do anything harmful to it. ",
            "name": "Dominate Beast",
            "duration": "1 hour",
            "school": "enchantment"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "100 feet",
            "description": "Through the link, you choose the target's The target can communicate simple concepts The target makes a new saving throw against Choose a creature within range that you can see. It must succeed on a Wisdom saving throw or be charmed by you for the duration. This spell has no effect upon undead or constructs. target while the two of you are on the same plane of existence. actions and where it moves by commanding it telepathically. Doing so requires no action on your part, but you must be able to take actions. You can also command the target to take a reaction, which requires the use of your reaction. If you give the target no commands, it does nothing other than what it needs to survive, such as moving away from a threat. communicate simple concepts to you. You can use your action to gain an awareness of the target's surroundings until the start of your next turn, as interpreted by the target's senses. the spell if you or your companions do anything harmful to it. ",
            "name": "Dominate Monster",
            "duration": "1 hour",
            "school": "enchantment"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a humanoid within range that you can see. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or your companions are fighting it, it has advantage on the saving throw. This spell has no effect upon undead or constructs. you have a telepathic link with it while the two of you are on the same plane of existence. actions and where it moves by commanding it telepathically. Doing so requires no action on your part, but you must be able to take actions. If you give the target no commands, it does nothing other than what it needs to survive, such as moving away from a threat. You have a telepathic link with the charmed Through the link, you choose the target's The target can use the telepathic link to The target makes a new saving throw against The charmed target can't take reactions, and Through the link, you choose the target's to you through the telepathic link, and you can use your action to gain an awareness of the target's surroundings until the start of your next turn, as interpreted by the target's senses. that is obviously self-destructive. The target makes a new saving throw against the spell if you give it an order that is counter to its alignment or if you or your companions do anything harmful to it. ",
            "name": "Dominate Person",
            "duration": "1 hour",
            "school": "enchantment"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "25 feet",
            "description": "Whispering to the earth and heeding the voice of the wind, you create one of the following effects within range. The target can communicate simple concepts The spell fails if you give the target an order You create a tiny, harmless sensory effect that lasts for up to 1 minute and predicts what the weather will be at your location for the next 24 hours. You might create a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. You produce up to five wisps of light that last for up to 1 minute. Each wisp emits dim light in a 5-foot radius. As part of the action you used to cast this cantrip, or as a separate action, you can direct the wisps to dance, move to any point within 25 feet of you that you can see, or trace a pattern in the air. The wisps can move as a group or independently. You instantly make a flower blossom, a seed pod open, or a leaf bud bloom. You instantly make a leaf, a pebble, a twig, or another natural object tumble or blow up to 25 feet in a cardinal direction you name, even if you do not know the direction. You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal crashing through brush, or the faint odor of skunk. You instantly light or snuff out a candle, a torch, or a small campfire. have up to three of its non-instantaneous effects active at a time. ",
            "name": "Druidcraft",
            "duration": "Instantaneous or 1 minute",
            "school": "Transmutation"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "500 feet",
            "description": "Choose a point on the ground within range that you can see. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point and shakes creatures and structures in contact with the ground in that area. terrain. Each creature on the ground that is concentrating on a spell must make a Constitution saving throw. On a failed save, the creature's concentration is broken. turn you spend concentrating on it, each creature on the ground in the area must make a Dexterity saving throw. On a failed save, the creature is knocked prone, and if it has 50 hit points or fewer, it cannot take actions until it leaves the area or the spell ends. the terrain in the area. spell's area at the start of your next turn after you cast the spell. Each Medium or smaller creature on the ground in the spell's area must succeed on a Dexterity saving throw or fall 1d10 normal. The DC to climb out is the same as the spell save DC. fissures. from the ceiling. Each creature in the affected area must make a Dexterity saving throw. On a failed save, the creature takes 5d6 bludgeoning damage, is knocked prone, and becomes buried in the rubble. On a successful save, it takes half as much damage and does not fall prone or become buried. might not be able to see or hear beyond the If you cast this spell multiple times, you can The ground in the area becomes difficult When you cast this spell and at the end of each This spell has additional effects depending on Open Ground: Fissures open throughout the Any pools of liquid in the area drain into the Falling Rubble: In any indoor area, rubble falls A creature buried in rubble cannot move and rubble. For each full minute the creature spends buried, it takes 2d6 bludgeoning damage. A buried creature can spend one minute to make a Strength check to try to dig out of the rubble. The DM sets the DC based on the material: DC 15 is appropriate for a typical mixture of earth and stone. On a successful check, the creature digs itself free. Another creature can spend a minute to dig out a creature buried in rubble. rubble takes more than a minute, depending on the amount of rubble involved. For example, a structure that has entirely collapsed produces more rubble than a ceiling that has simply dropped debris. vertical surface, such as a cliff, that does not have a ceiling, the vertical surface crumbles away and becomes a landslide. The landslide pushes out from the affected surface horizontally as far as it falls vertically. For example, if the affected area is 100 feet tall, the landslide spreads out 100 feet from the cliff's base in any direction where its path is unobstructed. The landslide begins at the start of your turn after you cast the spell. by falling rubble (see above). If a creature successfully saves against the rubble, the landslide moves the creature along with it in a straight line away from the vertical surface to a space on the slide's leading edge. damage to any structure in contact with the ground in the area when you cast the spell and at the start of each of your turns until the spell ends. If a structure drops to 0 hit points, it collapses. ",
            "name": "Earthquake",
            "duration": "Concentration, up to 1 minute",
            "school": "evocation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Self",
            "description": "Wrapping yourself in power from the Elemental Planes, you assume an elemental mantle for the duration. The effects of the mantle are determined by the element you choose. the ground. The range of all your weapon attacks is doubled, and ranged weapon attacks have The DM might decide that digging out from the Cliff: If the spell's area touches or includes a Each creature in the landslide's path is affected Structures: The tremor deals 50 bludgeoning Air: You are unaffected by difficult terrain on disadvantage against you or targets within 5 feet of you. that results from rock or rubble, and the ground within 20 feet of you is difficult terrain to others. Additionally, when you take bludgeoning, piercing, or slashing damage, you can use your reaction to halve that damage. creature within 5 feet of you hits or misses you with a melee attack, or otherwise makes physical contact with you, that creature takes 1d6 fire damage. In addition, your melee attacks deal 1d6 extra fire damage. land speed, and you can breathe underwater. You also have fire resistance. Finally, whenever you take fire or lightning damage, choose a point within 20 feet of you. Steam fills a 20-foot radius centered on that point, heavily obscuring the area until the end of your next turn. ",
            "name": "Elemental Mantle",
            "duration": "10 minutes",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "5 feet",
            "description": "Choose a weapon within range. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls. Additionally, choose one of the following damage types: acid, cold, fire, lightning, or thunder. The weapon's normal damage type is replaced by the damage type you choose until the spell ends. spell slot of 5th level or higher, the weapon's bonus to attack and damage rolls increases to +2. If you use a spell slot of 7th level or higher, the bonus increases to +3. ",
            "name": "Elemental Weapon",
            "duration": "4 hours",
            "school": "transmutation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a point on the ground within range that you can see. For the duration, grasping roots and vines sprout within a 20-foot radius centered on Earth: You are unaffected by difficult terrain Fire: You are immune to fire damage. When a Water: You have a swim speed equal to your At Higher Levels: If you cast this spell using a that point and turn the ground in the area into difficult terrain. must succeed on a Strength saving throw or be restrained by the roots. The creature can use its action to make a Strength check against the spell's DC. On a success, the creature frees itself. away. ",
            "name": "Entangle",
            "duration": "1 minute",
            "school": "conjuration"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "Self",
            "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with the Material Plane. You become incorporeal and invisible for the duration or until you use your action to end the spell. During this time, you can move in any direction. If you move up or down, every 5 feet of movement costs an extra 5 feet. You can see and hear, but everything looks gray, and you cannot see anything more than 60 feet away. travel away from the Material Plane to the Deep Ethereal, and from there to the Inner Planes, including the Elemental Planes, the Feywild, or Ravenloft. In the Deep Ethereal, you can no longer perceive the Material Plane, and creatures in the Material Plane can no longer perceive or interact with you in any way. The Dungeon Master's Guide has more information about planar travel. ",
            "name": "Etherealness",
            "duration": "4 hours",
            "school": "transmutation"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "100 feet",
            "description": "The mage Evard studied the Plane of Shadow to learn its secrets. This spell is a legacy of that research. that you can see. Squirming, ebony tentacles appear within a 20-foot radius centered on that A creature in the area when you cast the spell When the spell ends, the conjured plants wilt Once you are in the Ethereal Plane, you can Choose a point on the ground within range point and turn the ground in the area into difficult terrain for the duration. affected area or starts its turn there must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and be restrained by the tentacles. already restrained by the tentacles takes 3d6 bludgeoning damage. its action to make a Strength check against the spell's DC. On a success, the creature frees itself. from a giant octopus or a giant squid. ",
            "name": "Evard's Black Tentacles",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a point within range. Each object in a 10- foot radius centered on that point is outlined in blue, green, or violet light and emits dim light in a 10-foot radius for the duration. Any creature in the area is also outlined in light on a failed Dexterity saving throw. object has advantage if the attacker can see it, and the creature or object cannot benefit from being invisible. ",
            "name": "Faerie Fire",
            "duration": "1 minute",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "Bolstering yourself with a necromantic facsimile of life energy, you gain 1d4 + 4 temporary hit points for the duration. These hit points can exceed your hit point maximum, and they cannot be regained. If you take any damage, these hit points are lost first. a spell slot of 2nd level or higher, the temporary hit points increase by 5 for each level above 1st. amount of alcohol or distilled spirits. Any unrestrained creature that enters the A creature that starts its turn in the area and is A creature restrained by the tentacles can use Material Components: A piece of tentacle Any attack roll against an affected creature or At Higher Levels: When you cast this spell using Material Components: A small ",
            "name": "False Life",
            "duration": "1 hour",
            "school": "necromancy"
        },
        {
            "level": 1,
            "time": "1 reaction, which you take when",
            "range": "50 feet",
            "description": "Choose up to five falling creatures within range. A falling creature's rate of descent slows to 100 feet per round until the spell ends. The spell also ends on the creature when it lands. If the creature lands before the spell ends, it takes no falling damage and can land on its feet. ",
            "name": "Feather Fall",
            "duration": "1 minute",
            "school": "transmutation"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a creature within range that you can see. You blast the creature's mind, attempting to shatter its intellect and personality. If the target's hit point maximum is less than 150, it takes 4d6 psychic damage and must make a Wisdom saving throw. Charisma scores become 1. The creature cannot cast spells, use magic item powers, understand language, or communicate in any coherent way. The creature can, however, identify its friends, follow them, and even protect them. heal, limited wish, or wish. a spell slot 6th level or higher, the hit point maximum that feeblemind can effect increases by 25 for each level above 5th. crystal, glass, or mineral spheres. ",
            "name": "Feeblemind",
            "duration": "Permanent",
            "school": "enchantment"
        },
        {
            "level": 1,
            "time": "1 day",
            "range": "Self",
            "description": "you or a creature within 50 feet of you falls On a failed save, the creature's Intelligence and The spell can be ended by greater restoration, At Higher Level: When you cast this spell using Material Components: A handful of clay, You gain the service of a familiar, a spirit that takes an animal form you choose. The familiar has the following statistics. always obeys your commands. In combat, it rolls its own initiative and acts on its own turn. A familiar cannot make attacks. you can communicate with it telepathically. Your familiar acts independently of you, but it While you are within 100 feet of your familiar, Additionally, as an action, you can see through your familiar's eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the familiar has. During this time, you are deaf and blind with regard to your own senses. you can have it deliver a spell on your turn that requires touching a creature. The familiar touches the creature on your behalf, provided nothing is preventing it from taking actions. If the spell requires an attack roll, you use your attack modifier for the roll. so ends the effect. You cannot have more than one familiar at a time. charcoal, and incense and herbs worth 100 gp. The brazier is not consumed when you cast the spell. ",
            "name": "Find Familiar",
            "duration": "Permanent",
            "school": "conjuration (ritual)"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a creature within range that you can see. Negative energy courses through the creature, causing searing pain. If the creature has 40 hit points or fewer, it dies. Otherwise, it must make a Constitution saving throw. The creature takes 12d8 necrotic damage on a failed save, or half as much damage on a successful one. This spell has no effect upon undead or constructs. start of your next turn as a zombie under your command. ",
            "name": "Finger of Death",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "25 feet",
            "description": "You create two fiery acorns, pinecones, or holly berries and throw them at one or two creatures within range. Make a ranged attack roll for each seed. You have a bonus to the attack roll equal to your magic ability modifier + your spellcasting Finally, while within 100 feet of your familiar, You can release the familiar at any time. Doing Material Components: A brass brazier, A humanoid killed by this spell rises at the bonus, if any. On a hit, the target takes 2 fire damage as the seed erupts in orange-red flames. when you reach a caster level of 5th (4 fire), 10th (6 fire), 15th (9 fire), and 20th (11 fire). holly berries, or pine cones. ",
            "name": "Fire Seeds",
            "duration": "Instantaneous",
            "school": "Conjuration"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a point within range. A 100-foot cube made up of sheets of roaring flame appears centered on that point. Each creature in the area must make a Dexterity saving throw. A target takes 7d10 fire damage on a failed save, or half that much damage on a successful one. ignites flammable objects that are not being worn or carried. ",
            "name": "Fire Storm",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a point within range. A streak flashes from your pointing finger to that point and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius cloud centered on that point must make a Dexterity saving throw. A creature takes 6d6 fire damage on a failed save, and half as much damage on a successful one. ignites flammable objects that are not being worn or carried. a spell slot of 4th level or higher, the damage increases by 1d6 for each level above 3rd. guano and sulfur. At Higher Levels: The spell's damage increases Material Components: A handful of acorns, The fire damages objects in the area and The fire damages objects in the area and At Higher Levels: When you cast this spell using Material Components: A tiny ball of bat ",
            "name": "Fireball",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 2,
            "time": "Swift",
            "range": "Self",
            "description": "You evoke a fiery blade from one of your hands, similar in size and shape to a scimitar. The blade lasts for the duration or until you drop it. attack with the fiery blade, with a bonus to hit equal to your magic ability modifier + your spellcasting bonus. On a hit, the target takes 3d6 fire damage. light in a 10-foot radius and dim light for an additional 10 feet. a spell slot of 3rd level or higher, the damage increases by 1d6 for each level above 2nd. ",
            "name": "Flame Blade",
            "duration": "Concentration, up to 10 minutes",
            "school": "evocation"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "50 feet",
            "description": "A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a Dexterity saving throw. A creature takes 4d6 fire damage and 4d6 radiant damage on a failed save, and half as much damage on a successful one. a spell slot of 6th level or higher, the fire damage or the radiant damage (your choice) increases by 1d6 for each level above 5th. ",
            "name": "Flame Strike",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose an unoccupied space within range. A 5- foot-diameter sphere of fire appears there and lasts for the duration. You can use your action to make a melee The flames created by this spell emit bright At Higher Levels: When you cast this spell using At Higher Levels: When you cast this spell using of the sphere must succeed on a Dexterity saving throw or take 2d6 fire damage (half damage on a successful save). feet. You may direct the sphere over barriers up to 5 feet tall and jump it across pits up to 10 feet wide. The sphere ignites flammable objects, and it emits bright light in a 20-foot radius and dim light for an additional 40 feet. a spell slot of 3rd level or higher, the damage increases by 1d6 for each level above 2nd. of brimstone, and a dusting of powdered iron. ",
            "name": "Flaming Sphere",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose one creature within range that you can see. If the target's body is made of flesh, the creature must make a Constitution saving throw. On a failed save, it is restrained as its flesh begins to harden. On a successful save, the creature is not affected. This spell has no effect upon undead or constructs. another Constitution saving throw at the start of your next turn. On a successful save, the creature breaks free of the spell. On a failed save, the creature turns to stone and remains that way for the duration. stunned and has resistance to all damage. If it is physically broken or damaged while in this state, the creature suffers from similar damage or deformities when it reverts to its original state. spell for the entire possible duration, the creature is permanently turned to stone and dies. ",
            "name": "Flesh to Stone",
            "duration": "Concentration, up to 1 minute",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Touch",
            "description": "Material Components: Lime, water, and earth. Any creature that starts its turn within 5 feet As an action, you can move the sphere up to 30 At Higher Levels: When you cast this spell using Material Components: A bit of tallow, a pinch A creature restrained by this spell must make A creature turned to stone by this spell is If you maintain your concentration on this Touch a willing creature. The target gains a fly speed of 60 feet for the duration. When the spell ends, the target falls at the start of its next turn if it is still aloft and has no means to stop the fall. any bird. ",
            "name": "Fly",
            "duration": "Concentration, up to 1 hour",
            "school": "transmutation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create a 20-foot-radius cloud of fog centered on a point within range. The cloud's area is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. a spell slot of 2nd level or higher, the radius of the mist increases by 20 feet for each level above 1st. ",
            "name": "Fog Cloud",
            "duration": "Concentration, up to 1 hour",
            "school": "conjuration"
        },
        {
            "level": 9,
            "time": "1 minute",
            "range": "Touch",
            "description": "You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target cannot be surprised and has advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls against the target for the duration. feather. ",
            "name": "Foresight",
            "duration": "1 hour",
            "school": "divination"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "Touch",
            "description": "Touch a willing creature. For the duration, the target is unaffected by difficult terrain, and magical effects can neither reduce the target's Material Components: A wing feather from At Higher Levels: When you cast this spell using Material Components: A hummingbird speed nor cause the target to be paralyzed or restrained. to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled. Finally, being underwater imposes no penalties on the target. bound around the arm or a similar appendage. ",
            "name": "Freedom of Movement",
            "duration": "1 hour",
            "school": "abjuration"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a point within range. You conjure a portal linked to a precise location on a plane of existence other than the one you are on. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration. where it appears; it is not visible from the back. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other plane, appearing in the unoccupied space nearest to the portal. portals created by this spell from opening in their presence or anywhere within their demesnes. creature's true name that you have learned. If that creature is on a plane other than the one you are on, the portal opens in the named creature's immediate vicinity and draws the creature through it to the nearest unoccupied space on your side of the portal. Uttering a creature's true name to accomplish this act gives you no power over the creature, and it is free to act as the Dungeon Master deems appropriate. It might leave, attack you, or help you. least 5,000 gp. The target can also spend 5 feet of movement Material Components: A leather thong, The portal has a front and a back on each plane Deities and other planar rulers can prevent When you cast this spell, you can speak a Material Components: A diamond worth at ",
            "name": "Gate",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "5 feet",
            "description": "Choose a corpse or other remains within range. For the duration, the target is protected from decay and cannot become an undead creature. on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as raise dead. copper piece for each eye the corpse has or had. ",
            "name": "Gentle Repose",
            "duration": "7 days",
            "school": "necromancy (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Touch",
            "description": "Up to ten berries in your hand are infused with life-giving magic for the duration. A creature can use its action to eat one berry or feed it to someone else. Eating a berry restores 1 hit point, and the berry provides the same nourishment as a meal. ",
            "name": "Goodberry",
            "duration": "24 hours",
            "school": "transmutation"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "25 feet",
            "description": "You conjure a vine that sprouts from the ground at a point you designate within range. When you cast this spell, you can direct the vine to lash out at a creature within 25 feet of it. That creature must succeed on a Dexterity saving throw or be pulled 20 feet directly toward the vine. a part of your move or your action, you can direct the vine to lash out at the same creature or another one. The spell also effectively extends the time limit Material Components: A pinch of salt and one Once on each of your turns for the duration, as ",
            "name": "Grasping Vine",
            "duration": "1 minute",
            "school": "conjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a point on the ground within range. Slick grease covers the ground in a 10-foot square centered on that point and turns it into difficult terrain for the duration. must succeed on a Dexterity saving throw or fall prone. A creature that enters the area or ends its turn there must succeed on a Dexterity (Acrobatics) check against the spell's save DC or fall prone. butter. ",
            "name": "Grease",
            "duration": "1 minute",
            "school": "conjuration"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose one creature, object, or magical effect within range. Any spell of 4th level or lower on the target ends. For each spell of 5th level or higher on the target, make a magic ability check. The DC equals 10 + the spell's level. On a successful check, the spell ends. ",
            "name": "Greater Dispel Magic",
            "duration": "Instantaneous",
            "school": "abjuration"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "Touch",
            "description": "You imbue a creature you touch with positive energy to undo any debilitating effects it suffers. Choose one of the following effects. target to be charmed. benefit can break the target's attunement to one cursed magic item. reduced ability scores to their normal values. When the grease appears, each creature on it Material Components: A bit of pork rind or Break Enchantment: End one effect causing the Lift Curse: End one curse on the target. This Restore Ability: Return any of the target's reduces the target's hit point maximum. stone or some other inorganic material back to its original form. at least 100 gp. ",
            "name": "Greater Restoration",
            "duration": "Instantaneous",
            "school": "abjuration"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose a point within range. A Large spectral guardian appears and hovers there for the duration. The ghostly guardian is indistinct except for a radiant sword and a gleaming shield emblazoned with the symbol of your deity. Creatures you designate when you cast the spell are not affected by the guardian. 10 feet of the guardian must succeed on a Dexterity saving throw or take 15 radiant damage (half damage on a successful save). The guardian vanishes when it has dealt a total of 60 damage. ",
            "name": "Guardian of Faith",
            "duration": "4 hours",
            "school": "conjuration"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch one willing creature not affected by this spell, calling upon the gods for aid. Once before the spell ends, the target can roll a d4 and add the number rolled to one ability check of its choice. It may choose to roll the die before or after rolling the ability check. The spell then ends. the duration has passed. ",
            "name": "Guidance",
            "duration": "1 minute",
            "school": "Divination"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "50 feet",
            "description": "Restore Hit Point Maximum: End any effect that Stone to Flesh: Restore a creature turned to Material Components: Diamond dust worth Any other creature that enters the area within The spell ends early if you cast it again before A line of swiftly moving air that is 50 feet long and 10 feet wide emanates from you in a direction you choose. Each creature in the line must succeed on a Strength saving throw or fall prone. hour) that can disperse gas or vapor. torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them. ",
            "name": "Gust of Wind",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "Self",
            "description": "You can cast this spell when you make a ranged weapon attack on your turn. This spell creates a rain of long, sharp thorns to sprout from your ranged weapon or ammunition, falling upon your enemies. In addition to the normal effect of the attack, the target of the attack and each creature within 5 feet of it must make a Dexterity saving throw or take 1d10 piercing damage (half damage on a successful save). spell slot of 2nd level or higher, the damage increases by 1d10. ",
            "name": "Hail of Thorns",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a creature within range that you can see. You unleash a virulent disease that runs rampant through the creature's body, leaving it with significant injuries. Roll 14d6. you rolled, its hit point maximum becomes 1 for the duration. than the total you rolled, it must make a Constitution saving throw. On a failed save, it takes necrotic damage equal to the total you The spell creates a strong wind (30 miles per In addition, the gust extinguishes candles, At Higher Levels: If you cast this spell using a If the target has fewer hit points than the total If the target's hit points are equal to or greater rolled, and on a successful one, it takes half as much damage. The damage cannot reduce the target's hit points below 1. constructs. ",
            "name": "Harm",
            "duration": "1 hour",
            "school": "necromancy"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose a willing creature within range. Until the spell ends, the target's speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity saving throws, and it gains an additional, hasted action on each of its turns. cantrip, make a single attack, disengage, or hustle. take actions until after its next turn, as a wave of lethargy sweeps over it. root. ",
            "name": "Haste",
            "duration": "Concentration, up to 1 minute",
            "school": "transmutation"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a creature within range. A surge of positive energy washes through the creature, causing it to regain 60 hit points. This spell also ends blindness, deafness, and any diseases affecting the target. This spell has no effect upon undead or constructs. ",
            "name": "Heal",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "50 feet",
            "description": "As you call out a brief prayer, a creature of your choice within range regains 1d8 + 2 hit points. This spell has no effect upon undead or constructs. This spell has no effect upon undead or The hasted action can be used only to cast a When the spell ends, the target can't move or Material Components: A shaving of licorice a spell slot of 2nd level or higher, the hit points regained increase by 1d8 for each level above 1st. ",
            "name": "Healing Word",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a manufactured metal object such as a metal weapon or a suit of heavy or medium metal armor within range that you can see. You cause the object to glow red-hot until the start of your next turn. While the target is hot, any creature that is holding or wearing the object, as well as any creature that touches it, takes 3d8 fire damage. A creature can take this damage only once during a round. and takes damage from it, the creature must succeed on a Constitution saving throw or drop the object. If it is not able to drop the object, the creature has disadvantage on attack rolls and ability checks until the spell ends. a spell slot of 3rd level or higher, the damage increases by 1d8 for each level above 2nd. ",
            "name": "Heat Metal",
            "duration": "1 round",
            "school": "transmutation"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a creature within range that you can see. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. This spell has no effect upon undead or constructs. target can make another saving throw. On a success, the spell ends. of iron. ",
            "name": "Hold Monster",
            "duration": "Concentration, up to 1 minute",
            "school": "enchantment"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "100 feet",
            "description": "At Higher Levels: When you cast this spell using If a creature is holding or wearing the object At Higher Levels: When you cast this spell using At the end of each of its turns, the affected Material Components: A small, straight piece Choose a living humanoid within range that you can see. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. target can make another saving throw. On a success, the spell ends. of iron. ",
            "name": "Hold Person",
            "duration": "Concentration, up to 1 minute",
            "school": "enchantment"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Self",
            "description": "An aura of harmony radiates from you, facilitating communication in a 25-foot radius. For the duration, each creature in the area that can speak, including you, can understand the speech of any other creature in the area, regardless of what language is spoken. ",
            "name": "Holy Accord",
            "duration": "Concentration, up to 10 minutes",
            "school": "enchantment"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "25 feet",
            "description": "You and up to eight willing creatures within range are bathed in a soft glow of divine radiance. Each affected creature emits dim light in a 5-foot radius for the duration. saving throws, and other creatures have disadvantage on attack rolls against it. In addition, when a fiend or an undead creature hits a protected creature with a melee attack, the aura flashes with brilliant light. The attacker must succeed on a Constitution saving throw or be blinded until the spell ends. worth at least 1,000 gp that contains a sacred relic, such as a scrap of cloth from a saint's robe or a piece of parchment from a holy text. ",
            "name": "Holy Aura",
            "duration": "Concentration, up to 1 minute",
            "school": "abjuration"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Touch",
            "description": "At the end of each of its turns, the affected Material Components: A small, straight piece A creature lit in this way has advantage on all Requirement: You must have a tiny reliquary Your touch imbues a willing creature with blessed vigor. It gains 3d8 + 6 temporary hit points for the duration. These hit points can exceed the creature's hit point maximum, and they cannot be regained. If the creature takes any damage, these hit points are lost first. a spell slot of 4th level or higher, the temporary hit points increase by 2d8 for each level above 3rd. ",
            "name": "Holy Vigor",
            "duration": "8 hours",
            "school": "abjuration"
        },
        {
            "level": 7,
            "time": "Swift",
            "range": "25 feet",
            "description": "You utter a divine word, imbued with the power that shaped the world at the dawn of creation. Choose any number of creatures within range. Each one must make a Charisma saving throw. On a failed save, the creature suffers an effect based on its current hit point total. A celestial, elemental, or fiend that fails its save is forced back to its plane of origin (if it is not there already) and cannot return to your current plane for 24 hours by any means short of a wish spell. ",
            "name": "Holy Word",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "100 feet",
            "description": "You choose a creature within range and mystically mark it as your quarry. Until the spell ends, your attacks deal 1d6 extra damage to that creature, and you have advantage on any At Higher Levels: When you cast this spell using for 10 minutes stunned for 1 hour Wisdom (Perception) or Intelligence (Search) check you make to find it. ",
            "name": "Hunter's Mark",
            "duration": "Concentration, up to 1 hour",
            "school": "divination"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "25 feet",
            "description": "A veil of shadows and silence radiates from you, masking you and your companions within 25 feet of you from detection. For the duration, each friendly creature in the area, including you, has a +10 bonus to Dexterity (Stealth) checks and cannot be tracked except by magical means. ",
            "name": "Hunter's Veil",
            "duration": "1 hour",
            "school": "transmutation"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "50 feet",
            "description": "A hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a Dexterity saving throw. A creature takes 2d8 bludgeoning damage and 4d6 cold damage on a failed save, and half as much damage on a successful one. the storm's area of effect into difficult terrain. a spell slot of 5th level or higher, the bludgeoning damage increases by 1d8 for each level above 4th. few drops of water. ",
            "name": "Ice Storm",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "1 hour",
            "range": "5 feet",
            "description": "You learn the properties of a magic item of your choice within range. If the item has any special lore associated with it, you learn that lore as well. includes wine, an owl feather, and crushed pearl Until the end of your next turn, hailstones turn At Higher Levels: When you cast this spell using Material Components: A pinch of dust and a Material Components: An infusion that ",
            "name": "Identify",
            "duration": "Instantaneous",
            "school": "divination (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose a creature within range that you can see. It must make a Constitution saving throw. It takes 3d8 necrotic damage on a failed save, and half as much damage on a successful one. This spell has no effect upon undead or constructs. a spell slot of 2nd level or higher, the damage increases by 1d8 for each level above 1st. ",
            "name": "Inflict Wounds",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "100 feet",
            "description": "Swarming, biting locusts fill a 20-foot-radius cloud centered on a point you choose within range. The cloud remains for the duration and is lightly obscured. make a Constitution saving throw. A creature takes 2d10 piercing damage on a failed save, and half as much damage on a successful one. that ends its turn there takes 2d10 piercing damage. a spell slot of 6th level or higher, the damage increases by 1d10 for each level above 5th. ",
            "name": "Insect Plague",
            "duration": "Concentration, up to 10 minutes",
            "school": "conjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "Touch a willing creature. The creature becomes invisible for the duration. The spell ends early if the creature attacks or casts a spell on anything other than itself. The spell also ends if you cast it again or if you use your action to end it. a bit of gum arabic. At Higher Levels: When you cast this spell using A creature in the cloud when it appears must The cloud's area is difficult terrain. A creature At Higher Levels: When you cast this spell using Material Components: An eyelash encased in ",
            "name": "Invisibility",
            "duration": "1 hour",
            "school": "illusion"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose an object within range. The object can be a door, a box, a chest, a set of manacles, a padlock, or another object that contains a mundane or magical means that prevents access. that is stuck or barred becomes unlocked, unstuck, or unbarred if the DC required to open it is 20 or lower. If the object has multiple locks, only one of them is unlocked. this spell instead suppresses the magical effect for 1 minute, during which time the target can be opened and shut normally. from as far away as 50 feet, emanates from the target object. ",
            "name": "Knock",
            "duration": "Instantaneous",
            "school": "transmutation (ritual)"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a creature and send positive energy coursing through it. Choose one of the following effects. blinded or deafened, choose one of those conditions and end it. from any diseases, the most virulent one is cured. to any paralyzing effects, choose one of them and end it. ",
            "name": "Lesser Restoration",
            "duration": "Instantaneous",
            "school": "abjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a willing creature or an object within range that weighs up to 500 pounds. The target A target that is held shut by a mundane lock or If you choose a target that is magically locked, When you cast the spell, a loud knock, audible Remove Blindness or Deafness: If the creature is Remove Disease: If the creature is suffering Remove Paralysis: If the creature is subjected rises vertically, up to 20 feet, and remains suspended there for the duration or until you use your action to end the spell. The target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows the creature to move at half speed at its current altitude. turn. If the target is another creature or object, you can use your action to move the target 20 feet up or down. If you are the target, you can use your move to change your own altitude by the same amount. loop or a piece of golden wire bent into a cup shape with a long shank on one end. ",
            "name": "Levitate",
            "duration": "10 minutes",
            "school": "transmutation"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch an object. Until the spell ends, the object emits bright light in a 20-foot radius and dim light for an additional 20 feet. The spell ends early if you dismiss it (no action required) or cast it again. covered by an opaque object. phosphorescent moss. ",
            "name": "Light",
            "duration": "1 hour",
            "school": "Evocation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "100 feet",
            "description": "A line of lightning 100 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 6d6 lightning damage on a failed save, and half as much damage on a successful one. ignites flammable objects that are not being worn or carried. You can change the target's altitude on your Material Components: Either a small leather The light can be colored as you like and can be Material Components: A firefly or a piece of The lightning damages objects in the area and a spell slot of 4th level or higher, the damage increases by 1d6 for each level above 3rd. amber, crystal, or glass rod. ",
            "name": "Lightning Bolt",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Self",
            "description": "Describe or name a specific kind of beast or plant. Concentrating on the voice of nature in your surroundings, you learn the direction and distance to the closest creature or plant of that kind within 5 miles, if any are present. bloodhound. ",
            "name": "Locate Animals or Plants",
            "duration": "Instantaneous",
            "school": "divination (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Touch",
            "description": "Touch a creature that is not affected by this spell. Until the spell ends, that creature's speed increases by 10 feet. ",
            "name": "Longstrider",
            "duration": "1 hour",
            "school": "transmutation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Touch",
            "description": "Touch a willing creature that is not wearing armor. Until the spell ends, a magical force surrounds the target's body, shielding the creature from harm. The target's base AC becomes 13 + its Dexterity modifier. The spell ends early if the target dons armor or if you dismiss the spell as an action. leather. ",
            "name": "Mage Armor",
            "duration": "8 hours",
            "school": "abjuration"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "25 feet",
            "description": "At Higher Levels: When you cast this spell using Material Components: A bit of fur and an Material Components: A bit of fur from a Material Components: A piece of cured A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it (no action required) or cast this spell again. The hand vanishes if it is ever more than 25 feet away from you. action to control it. You can use the hand to manipulate an object, open a door or a container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 25 feet each time you use it. carry more than 10 pounds. ",
            "name": "Mage Hand",
            "duration": "1 minute",
            "school": "Conjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create three glowing blue darts of magical force. Each dart hits a creature of your choice within range that you can see. A dart deals 1d4 + 1 force damage to its target. The darts strike simultaneously, and you can direct them to hit one creature or several. a spell slot of 2nd level or higher, the spell creates one more dart for each level above 1st. ",
            "name": "Magic Missile",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "5 feet",
            "description": "Choose a nonmagical weapon within range. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls. spell slot of 4th level or higher, the bonus increases to +2. If you use a spell slot of 6th level or higher, the bonus increases to +3. While the hand is present, you can use your The hand cannot attack, use magic items, or At Higher Levels: When you cast this spell using At Higher Levels: If you cast this spell using a ",
            "name": "Magic Weapon",
            "duration": "4 hours",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create the image of an object, a creature, or some other visible phenomenon of size Large or smaller. The image appears at a spot within range and lasts for the duration. The image seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You cannot create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte's stench). Any physical interaction with the image reveals it to be an illusion, because objects pass through it. image can determine that it is an illusion with a Wisdom (Perception) check against your spell save DC. move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example. ",
            "name": "Major Image",
            "duration": "Concentration, up to 10 minutes",
            "school": "illusion"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "50 feet",
            "description": "A wave of healing energy washes out from a point within range. Any number of creatures of your choice within 25 feet of that point regain 4d8 + 15 hit points. This spell has no effect upon undead or constructs. a spell slot of 7th level or higher, the healing increases to 6d8 + 20. A creature that uses its action to examine the You can use your action to cause the image to Material Components: A bit of fleece. At Higher Levels: When you cast this spell using ",
            "name": "Mass Cure Wounds",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "50 feet",
            "description": "A flood of healing energy flows from you into injured creatures around you. You restore up to 500 hit points, divided as you choose among any creatures within range. This spell has no effect upon undead or constructs. ",
            "name": "Mass Heal",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 3,
            "time": "Swift",
            "range": "50 feet",
            "description": "As you call out a brief prayer of restoration, choose up to six creatures within range. Each target regains 1d8 + 2 hit points. This spell has no effect upon undead or constructs. a spell slot of 4th level or higher, the healing increases by 1d8 for each level above 3rd. ",
            "name": "Mass Healing Word",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a point within range. Each creature you choose within 25 feet of that point that you can see must succeed on a Wisdom saving throw or be paralyzed for the duration. This spell has no effect upon undead or constructs. affected by this spell makes another saving throw. On a success, the spell ends on that creature. of iron. ",
            "name": "Mass Hold Monster",
            "duration": "Concentration, up to 1 minute",
            "school": "enchantment"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "100 feet",
            "description": "At Higher Levels: When you cast this spell using At the end of each of its turns, a creature Material Components: A small, straight piece Choose one willing creature within range to become the center of a 50-foot sphere of invisibility that lasts for the duration. Every willing creature within the sphere when it appears becomes invisible. Affected creatures can see each other, and themselves, as if unaffected by the spell. casts a spell that affects an enemy creature, the invisibility sphere ends. Furthermore, if at any time an affected creature leaves the sphere, the spell ends for that creature; reentering the sphere does not turn the creature invisible. a bit of gum arabic. ",
            "name": "Mass Invisibility",
            "duration": "Concentration, up to 10 minutes",
            "school": "illusion"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "50 feet",
            "description": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures within range that can hear and understand you and are not undead or constructs. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell. However, a suggestion that a pool of acid is actually pure water and that a quick dip would be refreshing is another matter. Urging a band of orcs to stop attacking your party so that the orcs and party could jointly loot a rich treasure elsewhere is likewise a reasonable use of the spell's power. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration, such as in the case of the orc band mentioned above. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do. You can instead specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of Each target must make a Wisdom saving throw. If any creature affected by this spell attacks or Material Components: An eyelash encased in soldiers give all their money to the first beggar they meet. If the condition is not met before the spell duration expires, the activity is not performed. either a bit of honeycomb or a drop of sweet oil. ",
            "name": "Mass Suggestion",
            "duration": "Concentration, up to 1 day",
            "school": "enchantment"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a creature within range that you can see. You banish the target into an extradimensional labyrinth, a different plane of existence. The target remains there for the duration or until it escapes the maze. make an Intelligence check contested by your magic ability check. (A minotaur automatically wins this contest.) On a success, the target escapes and the spell ends. the space it left or, if that space is occupied, in the unoccupied space nearest its former space. ",
            "name": "Maze",
            "duration": "Concentration, up to 10 minutes",
            "school": "conjuration"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Touch",
            "description": "Choose a point you can touch on a stone object or surface large enough to fully contain your volume. You can step into the stone at that point using your movement, melding yourself and all the equipment you carry with the stone for the duration. Nothing of your presence remains visible or otherwise detectable by nonmagical senses. what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. Material Components: A snake's tongue and To escape, the target must use its action to When the spell ends, the target reappears in While merged with the stone, you cannot see harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals you 6d6 bludgeoning damage. The stone's complete destruction (or transmutation into a different substance) expels you and deals you 50 bludgeoning damage. If expelled, you fall prone in an open space closest to where you first entered. ",
            "name": "Meld into Stone",
            "duration": "8 hours",
            "school": "transmutation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "100 feet",
            "description": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged attack roll against the target, with a bonus equal to your magic ability modifier + your spellcasting bonus, if any. On a hit, the target takes 3d6 acid damage immediately and 3d6 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much damage. a spell slot of 3rd level or higher, the initial damage increases by 1d6 for each level above 2nd. leaf and an adder's stomach. ",
            "name": "Melf's Acid Arrow",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 0,
            "time": "1 minute",
            "range": "Touch",
            "description": "Touch an object that is no larger than a 5-foot cube, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. A single break or tear in the object is mended, and any trace of the former damage is erased. An object with multiple breaks can be fixed with multiple applications of mending. construct, but the spell cannot restore magic to such an object. Minor physical damage to the stone does not At Higher Levels: When you cast this spell using Material Components: Powdered rhubarb This spell can physically repair a magic item or ",
            "name": "Mending",
            "duration": "Instantaneous",
            "school": "Transmutation"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "100 feet",
            "description": "You point your finger at a creature within range and whisper a message. The creature you indicate hears the message as a whisper. The creature can then reply to your message, which you hear as a whisper. provided you are familiar with a creature beyond the barrier. Magical silence, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood blocks the spell. The spell does not have to follow a straight line and can travel around corners, through gaps, and other openings freely. copper wire. ",
            "name": "Message",
            "duration": "1 round",
            "school": "Transmutation"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "1 mile",
            "description": "Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius cloud centered on each point you choose must make a Dexterity saving throw. A creature takes 6d6 fire damage and 6d6 bludgeoning damage on a failed save, and half as much damage on a successful one. A creature in the area of more than one fiery burst is affected only once. ignites flammable objects that are not being worn or carried. ",
            "name": "Meteor Swarm",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "25 feet",
            "description": "You create a ghost sound or a silent image within range that lasts for the duration or until you You can cast this spell through solid objects Material Components: A short piece of The spell damages objects in the area and dismiss it (no action required) or cast this spell again. If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a Wisdom (Perception) check against your spell save DC. originates from a point of your choice within range. The sound's volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends. a creature, or some other visible phenomenon at a spot within range. The illusion does not create sound or any other effect aside from its image. The image must fit within a 10-foot cube. Any physical interaction with the image reveals it to be an illusion, because objects pass through it. move to any spot within 25 feet of you. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking as you move it. ",
            "name": "Minor Illusion",
            "duration": "1 minute",
            "school": "Illusion"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Self",
            "description": "Two illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it's impossible to track which image is real. You can use your action to dismiss the illusory duplicates. or a harmful spell while a duplicate remains, that creature randomly determines whether it targets you or one of the duplicates. If you have two duplicates, the creature targets a duplicate if it rolls 1-4 on a d6. If you have one duplicate, the creature targets a duplicate if it rolls 1-3 on a d6. Ghost Sound: You create a sound that Silent Image: You create the image of an object, You can use your action to cause the image to Material Components: A bit of fleece. Each time a creature targets you with an attack modifier, and it uses your saving throws. If an attack hits a duplicate, or if a duplicate fails a saving throw against an effect that deals hit point damage, the duplicate disappears. see or if it relies on senses other than sight, such as blindsight or tremorsense. ",
            "name": "Mirror Image",
            "duration": "1 minute",
            "school": "illusion"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "A silvery beam of pale light shines down in a 5- foot-radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder. or starts its turn there is engulfed in ghostly flames that cause searing pain. The creature must make a Constitution saving throw. Shapechangers make this saving throw with disadvantage. A creature takes 3d8 radiant damage on a failed save, and half as much damage on a successful one. Shapechangers that fail the saving throw also instantly revert back to their natural forms and cannot assume different forms until they leave the spell's light. you can use an action to move the beam 50 feet in any direction. a spell slot of 3rd level or higher, the damage increases by 1d8 for each level above 2nd. ",
            "name": "Moonbeam",
            "duration": "Concentration, up to 1 minute",
            "school": "evocation"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "50 feet",
            "description": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration or until you cast this spell again. attack against a target of your choice within 5 feet of it. The attack roll has a bonus equal to your magic ability modifier + your spellcasting A duplicate's AC equals 10 + your Dexterity A creature is unaffected by this spell if it can't Each creature that enters the light on its turn On each of your turns after you cast this spell, At Higher Levels: When you cast this spell using When the sword appears, it makes a melee bonus, if any. On a hit, the target takes 3d10 force damage. can direct the sword to move up to 20 feet and repeat the attack against a target of your choice within 5 feet of it. Directing the sword requires no action, but you must be able to take actions. archmage Mordenkainen, a native of the world of GREYHAWK, though it has since spread throughout the multiverse. platinum sword with a grip and pommel of copper and zinc. It costs 250 gp to construct and is not consumed when you cast the spell. ",
            "name": "Mordenkainen's Sword",
            "duration": "1 minute",
            "school": "evocation"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose an area of terrain no larger than 40 feet on a side within range. You can reshape earth, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes cannot exceed half the area's largest dimension. So, if you affect a 40- foot square, you can create a pillar up to 20 feet high, raise or lower the square's elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. concentrating on the spell, you can choose a new area of terrain to affect. You can choose the same area of terrain multiple times to make more drastic changes to it. slowly, creatures in the area cannot usually be trapped or injured by the ground's movement. stone construction. Rocks and structures shift to accommodate the new terrain. If the way you shape the terrain would make a structure unstable, it might collapse. plant growth. The moved earth carries any plants along with it. Once on each of your subsequent turns, you This spell was invented by the famed Requirement: You must have a miniature At the end of every 10 minutes you spend Because the terrain's transformation occurs This spell cannot manipulate natural stone or Similarly, this spell does not directly affect (clay, loam, and sand) in a small bag, and an iron blade. ",
            "name": "Move Earth",
            "duration": "Concentration, up to 2 hours",
            "school": "transmutation"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose one creature within range that you can see. The target must make a Wisdom saving throw. On a successful save, the creature is not affected. On a failed save, the target begins a comic dance in place-shuffling, tapping its feet, and capering for the duration. This spell has no effect upon undead or constructs. to dance without leaving its space and has disadvantage on all saving throws. The only action a dancing creature can take is to make a Wisdom check against the spell's save DC to regain control of itself. On a successful check, the spell ends. when you cast this spell, the enchantment instead lasts for 10 days, until you use your action to end the spell, or until the creature dies of exhaustion. of Eight in the world of GREYHAWK, a lover of fine food and music, and if his eponymous irresistible dance spell is any indication, something of a practical joker. ",
            "name": "Otto's Irresistible Dance",
            "duration": "Concentration, up to 1 minute",
            "school": "enchantment"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "10 feet",
            "description": "Choose up to five willing creatures within range. For the duration, the creatures can move through any type of mundane terrain-mud, snow, dust, grassland, forest, or the like-and leave no physical evidence of their passage, including footprints and scent. Tracking the creatures is impossible except by magical means. Material Components: A mixture of soils A dancing creature must use all its movement If you know and use the target's true name The archmage Otto was a member of the Circle ",
            "name": "Pass without Trace",
            "duration": "1 hour",
            "school": "abjuration"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose a point on a wooden, plaster, or stone surface (such as a wall, a ceiling, or a floor) within range. A passage appears at that point and lasts for the duration. You choose the opening's dimensions: up to 5 feet wide, 8 feet tall, and 20 feet deep. The opening creates no instability in a structure surrounding it. or objects still in the passage created by the spell are safely ejected to an unoccupied space nearest to the surface on which you cast the spell. a deeper passage. seeds. ",
            "name": "Passwall",
            "duration": "1 hour",
            "school": "transmutation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "You reach into the mind of a creature within range that you can see, and craft an illusion that takes root in the creature's thoughts. The target must make a Wisdom saving throw. On a failed save, you create an illusory object, creature, or other visible phenomenon of your choice that is visible only to the target for the duration. This spell has no effect upon undead or constructs. other stimuli, also evident only to the creature. The illusion can appear to occupy up to 500 cubic feet, or a cube about 8 feet on a side- about the size of a typical Large creature. to try to disbelieve the illusion. When it does so, it makes a Wisdom check against the spell's saving throw DC. On a successful check, the spell ends. the phantasm as if it were real. It rationalizes any illogical outcomes from interacting with the When the opening disappears, any creatures Casting this spell multiple times lets you create Material Components: A pinch of sesame The illusion includes sound, temperature, and A target affected by this spell can use its action While a target is affected by the spell, it treats illusion. For example, a target attempting to walk across a phantasmal bridge that spans a chasm will fall once it steps onto the bridge. If the creature survives the fall, it still believes that the bridge exists, and comes up with some other explanation for its fall-it was pushed, it slipped, or a strong wind might have knocked it off. phantasm's reality that it can even take damage from the illusion. A phantasm created to appear as a creature can attack the target. Similarly, a phantasm created to appear as fire, a pool of acid, or lava can burn the target. Each round on your turn, you can cause the phantasm to deal 1d6 damage to the target if it is in the phantasm's area or within 5 feet of it. The damage is of a type appropriate to the illusion. A fire deals fire damage, a monster armed with a longsword deals slashing damage, and so on. ",
            "name": "Phantasmal Force",
            "duration": "Concentration, up to 10 minutes",
            "school": "illusion"
        },
        {
            "level": 6,
            "time": "10 minutes.",
            "range": "50 feet.",
            "description": "You beseech an otherworldly entity known to you, such as a god, a primordial, a demon prince, or some other being of cosmic power for aid. That entity causes a celestial, an elemental, or a fiend loyal to it to appear in an unoccupied space within range. If you know a creature's true name, you can speak that name when you cast this spell to call that creature. In that case, the creature can be of any type. (that is, under no compulsion to behave a certain way). You might ask the creature to perform a service in exchange for payment. The requested task could range from simple (fly us across the chasm, help us fight a battle) to complex (spy on our enemies, protect us during our foray into the dungeon). You must be able to communicate with the creature to bargain for its services. might require a sizable donation of gold or magic items to an allied temple, while a fiend might demand a living sacrifice or a direct gift of An affected target is so convinced of the Material Components: A bit of fleece. When the creature appears, it acts normally Payment can take a variety of forms. A celestial treasure. Some creatures might exchange their service for a favor from you. the agreed-upon duration of service expires, the creature returns to its home plane after reporting back to you, if appropriate to the task and if possible. tasks of a certain length follow. The DM can adjust these payments based on the circumstances under which you cast the spell. If the task is aligned with the creature's ethos, the payment might be halved or even waived. Nonhazardous tasks typically require only half the suggested payment, while especially dangerous tasks might require a greater gift. Creatures rarely accept tasks that seem suicidal. as a member of your group, receiving a full share of experience points awarded. ",
            "name": "Planar Ally",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "Touch",
            "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM's discretion. a teleportation circle on another plane of existence, this spell can take you to its exact After the creature completes the task, or when Some general guidelines about payments for minutes hours days A creature enlisted to join your group counts Alternatively, if you know the sigil sequence of location. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle. creature to another plane. Choose a creature you can touch. That creature must make a Dexterity saving throw. On a failed save, you touch the creature, which must then make a Charisma saving throw. If the creature fails this save, it is shunted to the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence. worth at least 250 gp, attuned to a particular plane of existence. ",
            "name": "Plane Shift",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 3,
            "time": "1 action or 8 hours",
            "range": "150 feet",
            "description": "This spell channels life and vitality into plants within a specific area. There are two possible uses for the spell, granting either short-term or long-term benefits. point within range. All normal plants in a 100- foot radius centered on that point become thick and overgrown. A creature moving through the area must spend 15 extra feet of movement for every 5 feet it would travel. within the spell's area from being affected. the land. All plants within range become enriched for 1 year. The plants yield twice the normal amount of food when harvested. ",
            "name": "Plant Growth",
            "duration": "Instantaneous",
            "school": "transmutation (ritual)"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a creature within range that you can see. If the target is willing, you transform it into a new form. This spell has no effect upon undead or constructs. You can use this spell to banish an unwilling Material Components: A forked, metal rod If you cast this spell using 1 action, choose a You can exclude one or more areas of any size If you cast this spell over 8 hours, you enrich maximum is 150 or higher, or if it is a shapechanger, it is unaffected. If the target is unwilling and its hit point maximum is lower than 150, it must make a Wisdom saving throw. On a failed save, you transform the creature into a new form. new form can be any beast whose number of Hit Dice is equal to or less than that of the target. The target gains the capabilities and limitations of the new form, and loses the capabilities and limitations of its original form. But the target retains its current hit points, as well as its Intelligence, Wisdom, and Charisma scores. in its new form if that form is physically capable of doing so. Otherwise, the gear melds into the new form and becomes nonfunctional until the spell ends. ",
            "name": "Polymorph",
            "duration": "Concentration, up to 1 hour",
            "school": "transmutation"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "50 feet",
            "description": "You utter a word of power that can compel a creature to die instantly. Choose one creature within range. If the creature has 100 hit points or fewer, it dies. Otherwise, the spell has no effect. ",
            "name": "Power Word Kill",
            "duration": "Instantaneous",
            "school": "enchantment"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "50 feet",
            "description": "You speak a word of power that can overwhelm a creature's mind, leaving it dumbfounded. Choose one creature within range. If the target has 150 hit points or fewer, it is stunned. Otherwise, the spell has no effect. saving throw at the end of each of its turns. On a successful save, the target is no longer stunned. If the target is unwilling and its hit point The transformation lasts for the duration. The The target continues to wear or carry any gear Material Components: An empty cocoon. The stunned target must make a Constitution ",
            "name": "Power Word Stun",
            "duration": "Instantaneous",
            "school": "enchantment"
        },
        {
            "level": 3,
            "time": "Swift",
            "range": "25 feet",
            "description": "Choose any number of creatures within range. Until the spell ends, each target gains the blessing of the gods, manifested in a +1 bonus to AC, attack rolls, weapon damage rolls, ability checks, and saving throws. ",
            "name": "Prayer",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 2,
            "time": "10 minutes",
            "range": "25 feet",
            "description": "Up to six creatures of your choice within range each regain 1d8 + 6 hit points. This spell has no effect upon undead or constructs. a spell slot of 3rd level or higher, the healing increases by 1d8 for each level above 2nd. ",
            "name": "Prayer of Healing",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "10 feet",
            "description": "This spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range. If you cast this spell multiple times, up to three of its non-instantaneous effects can be active at a time. At Higher Levels: When you cast this spell using that is harmless, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor. a torch, or a small campfire. larger than a cubic foot. nonliving material for up to 1 hour. ",
            "name": "Prestidigitation",
            "duration": "Up to 1 hour",
            "school": "Transmutation"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "Self",
            "description": "Eight shimmering, multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 50-foot cone must make a Dexterity saving throw. For each target, roll a d8 to determine which color ray affects it. failed save, or half that much damage on a successful one. on a failed save, or half that much damage on a successful one. damage on a failed save, or half that much damage on a successful one. on a failed save, or half that much damage on a successful one. a failed save, or half that much damage on a successful one. restrained. At the start of your next turn, the target must make a Constitution saving throw. If it fails that save, the creature turns to stone. A creature turned to stone by this spell is stunned and has resistance to all damage. If it is physically broken or damaged while in this state, the creature suffers from similar damage or deformities when it reverts to its original state. At the start of your next turn, the target must make a Wisdom saving throw; a successful save ends the blindness. If it fails that save, the creature is transported to another plane of the appear on an object or a surface for up to 1 hour. nonmagical trinket or an illusory image that lasts until the end of your next turn. the end of your next turn. 1. Red. The target takes 10d6 fire damage on a 2. Orange. The target takes 10d6 acid damage 3. Yellow. The target takes 10d6 lightning 4. Green. The target takes 10d6 poison damage 5. Blue. The target takes 10d6 cold damage on 6. Indigo. On a failed save, the target is 7. Violet. On a failed save, the target is blinded. DM's choosing. (Typically, a creature that is on a plane that is not its home plane is banished to that plane, while other creatures are cast into the Astral or Ethereal planes.) for 1 minute. Additionally, roll the d8 again until you get a result other than 8, and apply that effect to the target as well. ",
            "name": "Prismatic Spray",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a willing creature and choose one damage type: acid, cold, fire, lightning, or thunder. The target has resistance to that damage type for the duration. ",
            "name": "Protection from Energy",
            "duration": "Concentration, up to 1 hour",
            "school": "abjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "touch",
            "description": "You touch a willing creature. Until the spell ends, the target is protected against certain types of evil creatures: elementals, fey, fiends, and undead. creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, the target has advantage on any new saving throw against the relevant effect. powdered silver and iron sprinkled over and around the target ",
            "name": "Protection from Evil",
            "duration": "10 minutes",
            "school": "abjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison 8. White. On a failed save, the target is blinded The protection grants several benefits: Evil Material Components: Holy water or afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random. saving throws against poison, and it has resistance against poison damage. ",
            "name": "Protection from Poison",
            "duration": "1 hour",
            "school": "abjuration"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "10 feet",
            "description": "Choose a point within range. All nonmagical food and drink within a 5-foot-radius cloud centered on that point is purified and rendered free of poison and disease. ",
            "name": "Purify Food and Drink",
            "duration": "Instantaneous",
            "school": "transmutation (ritual)"
        },
        {
            "level": 5,
            "time": "1 hour",
            "range": "Touch",
            "description": "You touch a creature that has been dead no longer than 10 days and that is not undead. If the creature's soul is both willing and at liberty to rejoin the body, the creature returns to life with 1 hit point. cures nonmagical diseases that affected the creature at the time it died. This spell does not, however, remove magical diseases, curses, or similar effects; if these are not first removed prior to casting the spell, they take effect when the creature returns to life. not restore missing body parts. If the creature is lacking body parts or organs integral for its survival-its head, for instance-the spell automatically fails. target takes a -4 penalty to all attack rolls, saving throws, and checks. Every time the target completes a long rest, the penalty is lessened by 1 until it disappears. least 500 gp. For the duration, the target has advantage on This spell also neutralizes any poisons and This spell closes all mortal wounds, but it does Coming back from the dead is an ordeal. The Material Components: A diamond worth at ",
            "name": "Raise Dead",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "100 feet",
            "description": "A black beam of energy springs from your finger toward a creature within range. Make a ranged attack roll against the creature, with a bonus to the roll equal to your magic ability modifier + your spellcasting bonus, if any. On a hit, the target has disadvantage on attack rolls based on Strength or Dexterity, and it can deal no more than 1 damage with such an attack. This spell has no effect upon undead or constructs. target's turns, it can make a Constitution saving throw against the spell. On a success, the spell ends early. ",
            "name": "Ray of Enfeeblement",
            "duration": "1 minute",
            "school": "necromancy"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "50 feet",
            "description": "A beam of blue-white light streaks toward a creature within range. Make a ranged attack roll against that creature, with a bonus to the roll equal to your magic ability modifier + your spellcasting bonus, if any. On a hit, the target takes 1d8 cold damage, and its speed is reduced by 10 feet until your next turn. by 1d8 when you reach a caster level of 5th (2d8), 10th (3d8), 15th (4d8), and 20th (5d8). ",
            "name": "Ray of Frost",
            "duration": "Instantaneous",
            "school": "Evocation"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "10 feet",
            "description": "Choose an object within range. For the duration, you can decipher magical writing on that object that would otherwise be unintelligible, including a spell from someone else's spellbook, a spell on a scroll, mystical runes on a magic item, or a magic glyph. Deciphering this writing neither Until the spell ends, at the end of each of the At Higher Levels: The spell's damage increases activates its magic nor identifies any magical properties it might possess. deciphered with this spell, the inscription continues to be intelligible to you after the spell's duration. mineral prism worth at least 5 gp, which is not consumed when you cast the spell. ",
            "name": "Read Magic",
            "duration": "10 minutes",
            "school": "Divination"
        },
        {
            "level": 7,
            "time": "1 minute",
            "range": "Touch",
            "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points and then 1 hit point per minute for the duration. This spell has no effect upon undead or constructs. after 2 minutes. If you have the severed extremity and hold it to the stump, the spell instantaneously causes the limb to knit to the stump. ",
            "name": "Regenerate",
            "duration": "1 hour",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch one creature or object. All curses affecting it end, unless the object is a magic weapon, a shield, or a suit of armor. Such an item retains its curse, but the person wearing or holding the cursed item can remove or drop it and is no longer attuned to it. ",
            "name": "Remove Curse",
            "duration": "Instantaneous",
            "school": "abjuration"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch one willing creature. Once before the spell ends, that creature can roll a d4 and add the number rolled to one saving throw of its choice. Once a particular magical inscription is Material Components: A clear crystal or a Any limbs the creature is lacking are restored It may choose to roll the die before or after rolling the d20. The spell then ends. the duration has passed. ",
            "name": "Resistance",
            "duration": "1 minute",
            "school": "Abjuration"
        },
        {
            "level": 7,
            "time": "1 hour",
            "range": "Touch",
            "description": "You touch a dead creature that has been dead for no more than a century, that did not die of old age, and that is not undead. If its soul is free and willing, the target returns to life with all its hit points. normal diseases afflicting the creature when it died. It does not, however, remove magical diseases, curses, and the like; if such effects are not removed prior to casting the spell, they afflict the target on its return to life. restores any missing body parts. target takes a -4 penalty to all attack rolls, saving throws, and checks. Every time the target completes a long rest, the penalty is lessened by 1 until it disappears. that has been dead for one year or longer taxes you greatly. Until you complete a long rest, you cannot cast spells again, and you have disadvantage on all attack rolls, ability checks, and saving throws. least 1,000 gp. ",
            "name": "Resurrection",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "10 feet",
            "description": "Holy power radiates from you, protecting friendly creatures within 10 feet of you. For the duration, each friendly creature in the area, including you, gains resistance to bludgeoning, piercing, and slashing damage. The spell ends early if you cast it again before Material Components: A miniature cloak. This spell neutralizes any poisons and cures This spell closes all mortal wounds and Coming back from the dead is an ordeal. The Casting this spell to restore life to a creature Material Components: A diamond worth at ",
            "name": "Righteous Shield",
            "duration": "Concentration, up to 1 minute",
            "school": "abjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a length of rope that is up to 50 feet long. One end of the rope then rises into the air until the whole rope hangs perpendicular to the ground. At the upper end of the rope, an invisible entrance opens to an extradimensional space that lasts until the spell ends. climbing to the top of the rope. The space holds as many as eight Medium or smaller creatures. The rope can be pulled into the space, making the rope disappear from view outside the space. another plane of existence. Attacks and spells cannot cross through the entrance into the space, but those in the space can see out of it as if through a 3-foot-by-5-foot window centered on the rope. drops out when the spell ends. extract and a twisted loop of parchment. ",
            "name": "Rope Trick",
            "duration": "1 hour",
            "school": "transmutation"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "25 feet",
            "description": "Tongues of divine radiance, like flame, engulf a creature within range that you can see. Gaining no benefit from cover, the target must succeed on a Dexterity saving throw or take 1d8 radiant damage. by 1d8 when you reach a caster level of 5th (2d8), 10th (3d8), 15th (4d8), and 20th (5d8). ",
            "name": "Sacred Flame",
            "duration": "Instantaneous",
            "school": "Evocation"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "25 feet",
            "description": "The extradimensional space can be reached by Creatures in the extradimensional space are on Anything inside the extradimensional space Material Components: Powdered corn At Higher Levels: The spell's damage increases You ward a creature within range against enemy attacks. Until the spell ends, anyone who targets that creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, it must choose a new target or lose the attack or spell. Sanctuary doesn't protect the chosen creature from area effects, such as the explosion of a fireball. a spell that affects an enemy creature, this spell ends early. ",
            "name": "Sanctuary",
            "duration": "1 minute",
            "school": "abjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several. have a bonus to the roll equal to your magic ability modifier + your spellcasting bonus, if any. On a hit, the target takes 2d6 fire damage. a spell slot of 3rd level or higher, you create one additional ray for each level above 2nd. ",
            "name": "Scorching Ray",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 5,
            "time": "10 minutes",
            "range": "Self",
            "description": "You can see and hear a particular creature you choose, as long as it is on the same plane of existence as you. The target must make a Wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If the chosen creature makes an attack or casts Make a ranged attack roll for each ray. You At Higher Levels: When you cast this spell using and you cannot use this spell against it again for 24 hours. sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. A creature that can see the sensor sees luminous orb about the size of your fist. 1,000 gp, either a crystal ball, a silver mirror, or a font filled with holy water. ",
            "name": "Scrying",
            "duration": "Concentration, up to 10 minutes",
            "school": "divination"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "Self",
            "description": "You can cast this spell when you hit with a melee weapon attack on your turn. Your weapon flares with white-hot intensity, and the attack deals 1d6 extra fire damage to the target. Until the spell ends, at the start of each of its turns, the target must make a Constitution saving throw or take 1d6 fire damage. The spell ends when the creature makes a successful saving throw against it. a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each level above 1st. ",
            "name": "Searing Smite",
            "duration": "1 minute",
            "school": "evocation"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "25 feet",
            "description": "On a successful save, the target is not affected, On a failed save, the spell creates an invisible Material Components: A focus worth at least At Higher Levels: When you cast this spell using Choose any number of willing creatures that you can see within range. You give each target a new, illusory appearance. The spell disguises physical appearance as well as clothing, armor, weapons, and equipment. You can make each creature seem 1 foot shorter or taller and appear thin, fat, or in between. You can't change a target's body type, so you must choose a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The spell lasts for the duration, unless you use your action to dismiss it sooner. up to physical inspection. For example, if you use this spell to add a hat to a creature's outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel the creature's head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into something while it was seemingly still in midair. can use its action to inspect the target and make a Wisdom (Perception) check against the spell's saving throw DC. If it succeeds, it becomes aware that the target is disguised. ",
            "name": "Seeming",
            "duration": "12 hours",
            "school": "illusion"
        },
        {
            "level": 1,
            "time": "1 reaction, which you take when",
            "range": "Self",
            "description": "An invisible barrier of magical force, like a physical shield, appears to protect you. Until the start of your next turn, you have a +4 bonus to AC, including against the triggering attack, and you take no damage from magic missile. ",
            "name": "Shield",
            "duration": "1 round",
            "school": "abjuration"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "50 feet",
            "description": "Choose a creature within range. A shimmering field appears and surrounds that creature, The changes wrought by this spell fail to hold To discern that a target is disguised, a creature you are hit by an attack or targeted by the magic missile spell granting it a +1 bonus to AC. The bonus lasts for the duration. with a bit of holy text written on it. ",
            "name": "Shield of Faith",
            "duration": "Concentration, up to 10 minutes",
            "school": "abjuration"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "10 feet",
            "description": "The wood of your club or quarterstaff is imbued with nature's power and lashes out like a whip at a nearby creature. Make a melee attack roll against a creature within range. You have a bonus to the roll equal to your magic ability modifier + your spellcasting bonus, if any. On a hit, the target takes 1d8 bludgeoning damage. by 1d8 when you reach a caster level of 5th (2d8), 10th (3d8), 15th (4d8), and 20th (5d8). quarterstaff. ",
            "name": "Shillelagh",
            "duration": "Instantaneous",
            "school": "transmutation"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "5 feet",
            "description": "Lightning springs from your hand to deliver a brutal shock to a creature within range that you can see. The target must succeed on a Dexterity saving throw. Otherwise, the target takes 1d8 lightning damage, and it can't take reactions until its next turn. A target wearing heavy armor made of metal has disadvantage on the saving throw. by 1d8 when you reach a caster level of 5th (2d8), 10th (3d8), 15th (4d8), and 20th (5d8). ",
            "name": "Shocking Grasp",
            "duration": "Instantaneous",
            "school": "Evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "100 feet",
            "description": "Choose a point within range. No sound can be created within or pass through a 20-foot-radius Material Components: A small parchment At Higher Levels: The spell's damage increases Requirement: You must be holding a club or a At Higher Levels: The spell's damage increases sphere centered on that point for the duration. Creatures within the area of silence are effectively deafened, and casting a spell that involves speech is impossible there. ",
            "name": "Silence",
            "duration": "Concentration, up to 10 minutes",
            "school": "illusion (ritual)"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "100 feet",
            "description": "The magic of this spell makes creatures drowsy, and might send them to sleep. Choose a point within range, and roll 4d8. The total is how many hit points of creatures this spell can affect. Each creature to be affected must be within 20 feet of the point you chose. The spell ignores any creature that is unconscious, and it has no effect upon undead or constructs. current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected. a spell slot of 2nd level or higher, roll an additional 2d8 for each level above 1st. rose petals, or a live cricket. ",
            "name": "Sleep",
            "duration": "1 minute",
            "school": "enchantment"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "100 feet",
            "description": "Until the spell ends, freezing rain and sleet fall in a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused. slick ice, making it difficult terrain. When a creature enters the area or starts its turn there, the creature must succeed on a Dexterity saving throw or fall prone. Starting with the creature that has the lowest At Higher Levels: When you cast this spell using Material Components: A pinch of fine sand, The ground in the area becomes covered with few drops of water. ",
            "name": "Sleet Storm",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "100 feet",
            "description": "You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a Wisdom saving throw or be affected by this spell for the duration, causing it to move sluggishly. Additionally, the target takes a -2 penalty to AC and Dexterity saving throws, and it can either move or take an action on its turn, not both. ",
            "name": "Slow",
            "duration": "Concentration, up to 1 minute",
            "school": "transmutation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "A blaring cacophony erupts in a 10-foot radius centered on a point within range. Each creature in that area must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, and half as much damage on a successful one. A creature that fails this save is also deafened for 1 minute. a spell slot of 3rd level or higher, the damage increases by 1d8 for each level above 2nd. ",
            "name": "Sound Burst",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 0,
            "time": "Swift",
            "range": "Touch",
            "description": "Touch a living creature that has 0 hit points. The creature regains 1 hit point. This spell has no effect upon undead or constructs. Material Components: A pinch of dust and a An affected target's speed is halved. Material Components: A drop of molasses. At Higher Levels: When you cast this spell using ",
            "name": "Spare the Dying",
            "duration": "Instantaneous",
            "school": "Necromancy"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "Self",
            "description": "You gain the ability to comprehend and communicate with beasts for the duration. The intelligence and awareness of many beasts is limited by their intelligence, but at minimum, beasts can give you information about nearby locations and monsters, including whatever they can perceive or have perceived within the past day. You might be able to persuade a beast to perform a small favor for you. ",
            "name": "Speak with Animals",
            "duration": "10 minutes",
            "school": "divination (ritual)"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "10 feet",
            "description": "Choose a corpse within range. The corpse must still have a mouth, not be an undead creature, and not have been the target of this spell within the last 7 days. to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive. This spell does not return the creature's soul to its body, only its animating spirit. Thus, the corpse cannot learn new information, does not comprehend anything that has happened since it died, nor can it speculate about future events. ",
            "name": "Speak with Dead",
            "duration": "10 minutes",
            "school": "necromancy"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a willing creature. Until the spell ends, the target gains the ability to move up, down, and across vertical surfaces, and even upside down along ceilings, while leaving its hands free. The target uses its normal speed for this movement. Until the spell ends, you can ask the corpse up a spider. ",
            "name": "Spider Climb",
            "duration": "Concentration, up to 1 hour",
            "school": "transmutation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "100 feet",
            "description": "The ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves through the area, it takes 2d4 piercing damage for every 5 feet it travels. camouflaged to look natural. Any creature that cannot see the area of the spell at the time the spell is cast must make a Wisdom (Perception) check against the spell's saving throw DC to recognize the terrain as hazardous. ",
            "name": "Spike Growth",
            "duration": "10 minutes",
            "school": "transmutation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, the weapon makes a melee attack against a creature within 5 feet of it. The weapon has a bonus to hit equal to your magic ability modifier + your spellcasting bonus. On a hit, the target takes 1d8 force damage. spell ends, you can move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it. can take whatever form you choose. Some clerics of deities who are associated with a particular weapon (as St. Cuthbert is known for his mace, or Thor for his hammer) make the effect of this spell resemble that weapon. a spell slot of 3rd level or higher, the damage increases by 1 for each level above 2nd. Material Components: A drop of bitumen and The transformation of the ground is As part of your action on any turn until the The weapon is typically a hammer, though it At Higher Levels: When you cast this spell using ",
            "name": "Spiritual Weapon",
            "duration": "1 minute",
            "school": "evocation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create a 20-foot-radius cloud of yellow, nauseating gas centered on a point within range. The cloud's area is lightly obscured. The cloud lasts for the duration. must make a Constitution saving throw. On a failed save, the creature spends its action that turn retching and reeling. Undead and constructs are unaffected by the cloud. disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round. skunk cabbage leaves. ",
            "name": "Stinking Cloud",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a willing creature. Until the spell ends, the target's flesh becomes as hard as stone, giving it resistance to bludgeoning, piercing, and slashing damage. 100 gp. ",
            "name": "Stoneskin",
            "duration": "1 hour",
            "school": "abjuration"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "Sight",
            "description": "A churning storm cloud forms in the sky, centered on a point you can see and spreading to a radius of 360 feet. Lightning flashes in the area and thunder booms. Each creature under the cloud (no more than 5,000 feet beneath the cloud) when it appears must make a Constitution saving throw. On a failed save, the Each creature that starts its turn in the cloud A moderate wind (at least 10 miles per hour) Material Components: A rotten egg or several Material Components: Diamond dust worth creature takes 2d6 thunder damage and becomes deafened for 5 minutes. spell creates additional effects as follows. Each creature under the cloud takes 1d6 acid damage. the cloud to strike six creatures or objects of your choice beneath the cloud. A given creature or object can't be struck by more than one bolt. A struck creature must make a Dexterity saving throw. On a failed save, the creature takes 10d6 lightning damage, and half as much damage on a successful one. cloud. Each creature under the cloud takes 2d6 bludgeoning damage. wind gusts assail the area under the cloud. The area under the cloud becomes heavily obscured and difficult terrain. Each creature under the cloud takes 1d6 cold damage. Ranged weapon attacks in the area are impossible. The wind and rain count as a severe distraction for the purposes of maintaining concentration on spells. Finally, strong wind gusts (at least 20 miles per hour) automatically disperse fogs, mists, and similar phenomena, whether mundane or magical. this spell. ",
            "name": "Storm of Vengeance",
            "duration": "Concentration, up to 1 minute",
            "school": "conjuration"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "25 feet",
            "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature within range that can hear and understand you. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell. However, a suggestion that a pool of acid is actually pure water and that a quick dip would Each round you spend concentrating on this 2nd Round: Acidic rain falls from the cloud. 3rd Round: You call six bolts of lightning from 4th Round: Hailstones rain down from the 5th through 10th Round: Freezing rain and Requirement: You must be outdoors to cast be refreshing is another matter. Urging a red dragon to stop attacking your party so that the dragon and party could jointly loot a rich treasure elsewhere is likewise a reasonable use of the spell's power. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration, such as in the case of the dragon mentioned above. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do. You can instead specify conditions that will trigger a special activity during the duration. For example, you might suggest that a noble knight give her warhorse to the first beggar she meets. If the condition is not met before the spell duration expires, the activity is not performed. either a bit of honeycomb or a drop of sweet oil. ",
            "name": "Suggestion",
            "duration": "Concentration, up to 8 hours",
            "school": "enchantment"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "50 feet",
            "description": "A mote of brilliant light appears in your hand. It emits bright light in a 25-foot radius and dim light for an additional 25 feet. This light is sunlight, and it lasts for the duration. foot-long line of radiance. Each creature in the line must make a Constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and is not blinded. action on any turn until the spell ends. this saving throw. ",
            "name": "Sunbeam",
            "duration": "Concentration, up to 1 minute",
            "school": "evocation"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "100 feet",
            "description": "The target must make a Wisdom saving throw. Material Components: A snake's tongue and The mote also flashes with a 5-foot-wide, 50- You can create a new line of radiance as your Undead, oozes, fungi, and molds always fail Choose a point within range. Brilliant sunlight flashes in a 50-foot radius centered on that point. Each creature in that light must make a Constitution saving throw. On a failed save, a creature takes 12d6 radiant damage and is blinded for 1 minute. On a successful save, it takes half as much damage and is not blinded. saving throw. 9th level or lower. and a naked flame. ",
            "name": "Sunburst",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 3,
            "time": "Swift",
            "range": "Self",
            "description": "You can cast this spell when you hit with a melee weapon attack on your turn. Your weapon bursts with bright light, and the attack deals 3d8 extra radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends. ",
            "name": "Sunburst Smite",
            "duration": "1 minute",
            "school": "evocation"
        },
        {
            "level": 5,
            "time": "Swift",
            "range": "Self",
            "description": "You transmute your quiver to produce an endless supply of ammunition, which seems to leap into your hand when you reach for it. Until the spell ends, when you use the attack action to make a ranged attack on your turn with a weapon that uses ammunition, you can make two additional attacks with that same weapon as part of the same action. quiver magically replaces the piece of ammunition you used. Any pieces of ammunition created by this spell disintegrate when the spell ends. If you are no longer wearing or carrying the quiver, the spell ends. least one piece of ammunition, which is not consumed when you cast the spell. Undead, oozes, fungi, and mold always fail this This spell ends darkness created by spells of Material Components: A piece of sunstone Each time you make such a ranged attack, your Material Components: A quiver containing at ",
            "name": "Swift Quiver",
            "duration": "Concentration, up to 1 minute",
            "school": "transmutation"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "Self",
            "description": "You gain the ability to telekinetically manipulate creatures or objects for the duration. creature within 50 feet of you that is up to two sizes larger than you. If you do so, make a check with your magic ability contested by the creature's Strength check. up to 30 feet in any direction. Until the start of your next turn, the creature is restrained in your telekinetic grip. use your action to attempt to maintain your telekinetic grip on the creature. If you choose not to use your action for this purpose, the spell ends. contact with the ground or another surface capable of supporting it, you automatically maintain your grip when you try to do so, and you can move the creature up to 30 feet in any direction, as long as you don't move it farther than 50 feet from you. an immovable surface or is Large or larger, you must engage it in another contest. If the creature wins the contest, the spell ends. object within 50 feet of you that you want to manipulate. If you do so, the spell works as if you had targeted a creature, with the following exceptions: Creature: You can use your action to choose a If you win the contest, you move the creature In each round after you cast the spell, you can If the creature is being held in the air, out of If the creature in your grip can get purchase on Object: You can use your action to select an 300 pounds or less that is not being worn or carried. creature, you must make a check with your magic ability contested by that creature's Strength check. telekinetic grip, such as manipulating a simple tool, opening a door or a container, stowing or ",
            "name": "Telekinesis",
            "duration": "Concentration, up to 10 minutes",
            "school": "transmutation"
        },
        {
            "level": 7,
            "time": "1 action",
            "range": "10 feet",
            "description": "Choose up to five willing creatures within range. You and each creature you chose are instantly transported from your current location to a destination that is known to you on the same plane of existence. Your familiarity with the destination determines whether you arrive there successfully. Roll d100 and consult the table. permanent teleportation circle whose sigil sequence you know. \"Very familiar\" is a place you have been very often and where you feel at home. \"Studied carefully\" is a location you know well, because you have been there often or you have used other means to study the place. \"Seen casually\" is someplace you have seen more than once but with which you are not very familiar. \"Viewed once\" is a place you have seen once, possibly using magic. \"Description\" is a place whose location and appearance you know through someone else's description, perhaps from a map. Perhaps you tried to scry an enemy's sanctum but instead viewed an illusion, or you are attempting to teleport to a familiar location that no longer exists. object taken from the desired destination within the last six months, such as a book from a wizard's library, bed linen from a royal suite, a retrieving an item from an open container, or pouring the contents from a vial. Familiarity: \"Permanent circle\" means a \"False destination\" is a place that doesn't exist. \"Associated object\" means that you possess an chunk of marble from a lich's secret tomb, or the like. you want to. random distance away from the destination in a random direction. Distance off target is 1d10  1d10% of the distance that was to be traveled. For example, if you tried to travel 120 miles, landed off target, and rolled a 5 and 3 on the two d10s, then you would be off target by 15%, or 18 miles. The DM determines the direction off target randomly by rolling a d8. On a 1, north; 2, northeast; 3, east; 4, southeast; 5, south; 6, southwest; 7, west; 8, northwest. If you were teleporting to a coastal city and wound up 18 miles out at sea, you could be in trouble. visually or thematically similar to the target area. A mage heading for her home laboratory, for example, might wind up in another mage's laboratory or in an alchemical supply shop that has many of the same tools and implements as in her laboratory. Generally, you appear in the closest similar place, but since the spell has no range limit, you could conceivably wind up anywhere on the plane. you are assaulted by the spell's magic. You each take 1d10 force damage, and you reroll on the table to see where you wind up. For these rerolls, roll 1d20 + 80 instead of d100. Each time this result comes up, you take another 1d10 force damage and reroll. ",
            "name": "Teleport",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 5,
            "time": "1 minute",
            "range": "10 feet",
            "description": "You draw a 10-foot circle on the ground inscribed with sigils that link your location to a permanent teleportation circle of your choice whose sigil sequence you have learned. Many major temples, guilds, and other places of import have permanent teleportation circles inscribed somewhere within their confines. opens within the circle you drew and remains On Target: You and your group appear where Off Target: You and your group appear a Similar Area: You wind up in an area that's Mishap: You and anyone else teleporting with Upon casting the spell, a shimmering portal open until the end of your next turn. Any creature that enters the portal instantly appears within 5 feet of the destination circle or in the nearest unoccupied space. arranged in a particular pattern. Each permanent teleportation circle in the world and beyond has a unique sigil sequence. When you first gain the ability to cast this spell, you learn two sigil sequences to destinations determined by the Dungeon Master. You can learn additional sigil sequences during your adventures. You can commit a new sigil sequence to memory after studying it for a minute. circle by casting this spell every day for one year in one location. You need not use the circle to teleport when you cast the spell in this way. ",
            "name": "Teleportation Circle",
            "duration": "1 round",
            "school": "conjuration"
        },
        {
            "level": 0,
            "time": "1 action",
            "range": "25 feet",
            "description": "You manifest a minor wonder, a sign of divine power. Choose one of the following effects within range. You can end any of those effects early (no action required). If you cast this spell multiple times, you can have up to three of its 1- minute effects active at a time. A sigil sequence is a string of magical runes You can create a permanent teleportation up to three times as loud as normal for the duration. dim, or change color for the duration. for the duration. to crack or a piece of cloth or parchment to smoke and singe. The object must be nonmagical. originates from a point of your choice within range, such as a rumble of thunder, the cry of an owl or raven, or ominous whispers. or window to fly open or slam shut. ",
            "name": "Thaumaturgy",
            "duration": "Up to 1 minute",
            "school": "Transmutation"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "Self",
            "description": "You can cast this spell when you hit with a melee weapon attack on your turn. Your weapon rings with thunder that is audible within 300 feet of you, and the attack deals 2d6 extra thunder damage to the target. Additionally, the creature must succeed on a Strength saving throw or be pushed 10 feet away from you and fall prone. a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each level above 1st. ",
            "name": "Thunderous Smite",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 1,
            "time": "1 action",
            "range": "15 feet",
            "description": "With a loud crack, a wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful one, it takes half as much damage and is not pushed. completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible within 300 feet of you. a spell slot of 2nd level or higher, the damage increases by 1d8. ",
            "name": "Thunderwave",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "Self",
            "description": "or alter the appearance of your eyes in some other way for the duration. At Higher Levels: When you cast this spell using In addition, unsecured objects that are At Higher Levels: When you cast this spell using You briefly stop the flow of time for everyone but yourself. Although no time passes for other creatures, you have a few seconds to move and act. You have 1d4 + 1 rounds of apparent time, during which you can use actions and move as normal. during this period targets a creature other than you or an object being worn or carried by someone other than you. In addition, the spell ends if you move to a place more than 1,000 feet from the location where you cast this spell. ",
            "name": "Time Stop",
            "duration": "Instantaneous",
            "school": "transmutation"
        },
        {
            "level": 8,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a creature within range that you can see. The target must make a Wisdom saving throw. On a failed save, you force the target's soul into a gemstone. While its soul is so trapped, the target's body and all the equipment it is carrying cease to exist. the gem is broken, at which time the target's body re-forms in an unoccupied space nearest to the gem and in the same state as when this spell was cast on it, with all the equipment it was carrying when it was trapped. telepathically with the trapped soul. Other creatures that inspect the gemstone see a tiny figure inside it. cast the spell, the target has disadvantage on the saving throw. worth at least 1,000 gp for each Hit Die of the creature you would trap. ",
            "name": "Trap the Soul",
            "duration": "Permanent",
            "school": "conjuration"
        },
        {
            "level": 9,
            "time": "1 hour",
            "range": "Touch",
            "description": "This spell ends if one of the actions you use The gem holds the target indefinitely or until You, and you alone, can communicate If you speak the target's true name when you Requirement: You must provide a gemstone You touch a creature that has been dead for no longer than 200 years and that died for any reason except old age. If the creature's soul is free and willing, the creature is restored to life with all its hit points. poison, cures all diseases, and lifts any curses affecting the creature when it died. The spell replaces damaged or missing organs and limbs. original no longer exists, in which case you must speak the creature's name. It then appears in an unoccupied space you choose within 10 feet of you. least 25,000 gp. ",
            "name": "True Resurrection",
            "duration": "Instantaneous",
            "school": "necromancy"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "Touch",
            "description": "You touch a willing creature. Until the spell ends, the creature can see things as they actually are out to a range of 120 feet. The creature sees in normal and magical darkness, notices secret doors hidden by magic, sees invisible creatures and objects, automatically detects visual illusions and succeeds on saving throws against them, and perceives the true forms of creatures affected by transmutation spells. Furthermore, the target can see into the Ethereal Plane. eyes that costs 25 gp and is made from mushroom powder, saffron, and fat. ",
            "name": "True Seeing",
            "duration": "1 hour",
            "school": "divination"
        },
        {
            "level": 4,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create a wall of fire on a solid surface within range. You can choose to make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall lasts for the duration, and it heavily obscures creatures behind it. This spell closes all wounds, neutralizes any The spell can even provide a new body if the Material Components: Treasure worth at Material Components: An ointment for the its area must make a Dexterity saving throw. On a failed save, it takes 5d8 fire damage. On a success, the creature can move 5 feet so it is not in the wall. cast this spell, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side or inside the wall, and each creature that enters the wall on its turn. The other side of the wall deals no damage. a spell slot of 5th level or higher, the damage increases by 1d8 for each level above 4th. phosphorus. ",
            "name": "Wall of Fire",
            "duration": "Concentration, up to 1 minute",
            "school": "evocation"
        },
        {
            "level": 5,
            "time": "1 action",
            "range": "100 feet",
            "description": "A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with at least one other panel. Alternatively, you can create 10-foot-by-20-foot panels that are only 3 inches thick. though it cannot occupy the same space as a creature or object. The wall need not be vertical, nor rest on any firm foundation. It must, however, merge with and be solidly supported by existing stone. Thus, you can use this spell to bridge a chasm or create a ramp. length, you must halve the size of each panel to create supports. You can crudely shape the wall to create crenellations, battlements, and so on. Each panel has AC 5, and it has 15 hit points per inch of thickness. The wall is immune to cold, fire, necrotic, psychic, and radiant damage, and is also immune to any effect that requires an Intelligence, Wisdom, or Charisma saving throw. Reducing a panel to 0 hit points destroys it and may cause connected panels to collapse at the DM's discretion. When the wall appears, each creature within One side of the wall, selected by you when you At Higher Levels: When you cast this spell using Material Components: A small piece of The wall can have any shape you desire, If you create a span greater than 20 feet in The wall can be damaged and thus breached. granite. ",
            "name": "Wall of Stone",
            "duration": "Instantaneous",
            "school": "evocation"
        },
        {
            "level": 6,
            "time": "1 action",
            "range": "100 feet",
            "description": "You create a wall of tough, pliable, tangled brush bristling with needle-sharp thorns. The wall appears within range on a solid surface and lasts for the duration. You choose to make the wall up to 50 feet long, 10 feet high, and 5 feet thick or a circle that has a 25-foot radius and is up to 20 feet high and 5 feet thick. The wall blocks line of sight. its area must make a Dexterity saving throw. On a failed save, it takes 7d8 slashing damage. On a success, the creature can move 5 feet so it is not in the wall. slowly and painfully. For every 5 feet a creature would travel through the wall, it must spend 20 feet of movement. Furthermore, a creature that enters the wall's space must make a Dexterity saving throw once each round it's in contact with the wall. On a failed save, a creature takes 7d8 slashing damage. On a successful save, it takes half as much damage. a spell slot of a level higher than 6th, the wall's length increases by 10 feet or the size of its radius increases by 5 feet and the damage increases by 1d8 for each level above 6th. ",
            "name": "Wall of Thorns",
            "duration": "Concentration, up to 10 minutes",
            "school": "conjuration"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose up to ten willing creatures within range. In addition to retaining its normal mode of respiration, each creature can now breathe underwater until the spell ends. of straw. Material Components: A small block of When the wall appears, each creature within A creature can move through the wall, albeit At Higher Levels: When you cast this spell using Material Components: A short reed or piece ",
            "name": "Water Breathing",
            "duration": "8 hours",
            "school": "transmutation"
        },
        {
            "level": 3,
            "time": "1 action",
            "range": "25 feet",
            "description": "Choose up to ten willing creatures within range. Until the spell ends, each target can move across any liquid surface-such as water, acid, mud, snow, quicksand, ice, or lava-as if it were solid ground. the spell carries the target to the surface of the liquid at a rate of 60 feet per round. ",
            "name": "Water Walk",
            "duration": "1 hour",
            "school": "transmutation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "You conjure a mass of thick, sticky webbing at a point of your choosing within range. The webs fill a 20-foot radius centered on that point for the duration. The webs are difficult terrain and lightly obscure their area. solid masses (such as walls or trees) or layered across a floor, wall, or ceiling, the conjured web collapses on itself and the spell ends at the start of your next turn. Webs layered over a flat surface have a depth of 5 feet. or that enters them for the first time during its turn must make a Dexterity saving throw. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free. action to make a Strength check against your spell save DC. If it succeeds, it is no longer restrained. webs exposed to fire burns away at the start of your next turn. The fire spreads 5 feet at the end of each turn until the web burns away. Any creature that starts its turn in an area of burning webs takes 2d4 fire damage. If you target a creature submerged in a liquid, If the webs are not anchored between two Each creature that starts its turn in the webs A creature restrained by the webs can use its The webs are flammable. Any 5-foot-cube of Material Components: A bit of spiderweb. ",
            "name": "Web",
            "duration": "Concentration, up to 1 hour",
            "school": "conjuration"
        },
        {
            "level": 6,
            "time": "1 minute",
            "range": "25 feet",
            "description": "You and up to 10 willing creatures within range assume a cloud form for the duration, appearing as nothing more than a wisp of cloud. While in a cloud form, a creature has a fly speed of 300 feet, and has resistance against damage from nonmagical weapons. The only actions a creature can take in this form are to hustle or to resume its normal form. Resuming normal form takes 1 minute. Until the duration expires, a creature can revert to cloud form; this also requires 1 minute. the effect ends, it descends 60 feet per round for 1 minute until it lands, which it does safely. If it cannot land after 1 minute, the creature falls the remaining distance. ",
            "name": "Wind Walk",
            "duration": "8 hours",
            "school": "transmutation"
        },
        {
            "level": 9,
            "time": "1 action",
            "range": "Self",
            "description": "Wish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires. other spell of 8th level or lower. You do not need to meet any requirements. The spell simply takes effect. following effects. If a creature is in cloud form and flying when The basic use of this spell is to duplicate any Alternatively, you can achieve any one of the that is not a magic item. item. points and end all effects on them described in the greater restoration spell. damage type, a magical effect, or some other You might be able to achieve something beyond the scope of the above examples. To do so, state your wish to the DM as precisely as possible. Your DM has a lot of latitude in ruling what occurs in such an instance; the greater the wish, the greater the likelihood that something goes wrong. Either the spell simply fails, the effect you desire is only partly achieved, or you suffer some unforeseen consequence as a result of how the wish was worded. For example, wishing that a villain were dead might propel you forward in time to a period when that villain is no longer alive, effectively removing you from the game. Similarly, wishing for a legendary magic item or artifact might instantly transport you to the presence of the item's current owner. effect other than duplicating another spell weakens you. Until you complete a long rest, you lose the ability to cast spells. In addition, your Strength drops to 3, if it is not 3 or lower already, for 2d4 days. For each of those days that you spend resting and doing nothing more than light activity, your remaining recovery time decreases by 2 days. ",
            "name": "Wish",
            "duration": "Instantaneous",
            "school": "conjuration"
        },
        {
            "level": 1,
            "time": "Swift",
            "range": "Self",
            "description": "Cast this spell when you hit with a melee weapon attack on your turn. Your weapon stirs up feelings of doom in your target, and the attack deals 1d6 extra psychic damage. Additionally, the creature must make a Wisdom saving throw effect for 8 hours. For instance, you could make yourself and all your companions immune to a lich's life drain attack. of any roll made within the last round (including your last turn). Reality reshapes itself to accommodate the new result. For example, a wish spell could undo an opponent's successful save, a foe's successful critical hit, a friend's failed save, and so on. You must accept the result of the reroll, even if it is less favorable to you than the original roll. The stress of casting this spell to produce any or be frightened until the spell ends. As an action, the creature can make a Wisdom check against your spell save DC to steel its resolve and end this spell. a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each level above 1st. ",
            "name": "Wrathful Smite",
            "duration": "1 minute",
            "school": "evocation"
        },
        {
            "level": 2,
            "time": "1 action",
            "range": "50 feet",
            "description": "Choose a point within range. You create a magical zone that guards against deception. Until the spell ends, any creature that enters a 15-foot radius centered on that point or that starts its turn there must make a Charisma saving throw. On a failed save, a creature cannot speak a deliberate lie while in the radius. You know whether each creature succeeds or fails on its saving throw. may thus avoid answering questions to which it would normally respond with a lie. Such a creature can be evasive in its answers as long as it remains within the boundaries of the truth. At Higher Levels: When you cast this spell using An affected creature is aware of the spell and ",
            "name": "Zone of Truth",
            "duration": "10 minutes",
            "school": "enchantment"
        }
    ],
    "classes": [
        {
            "spells": [
                [
                    "Dancing Lights",
                    "Light",
                    "Mage Hand",
                    "Mending",
                    "Message",
                    "Minor Illusion",
                    "Prestidigitation",
                    "Read Magic"
                ],
                [
                    "Animal Friendship",
                    "Cause Fear",
                    "Charm Person",
                    "Comprehend Languages",
                    "Cure Wounds",
                    "Detect Magic",
                    "Disguise Self",
                    "Faerie Fire",
                    "Feather Fall",
                    "Healing Word",
                    "Identify",
                    "Longstrider",
                    "Sleep",
                    "Speak with Animals",
                    "Thunderwave"
                ],
                [
                    "Animal Messenger",
                    "Heat Metal",
                    "Hold Person",
                    "Invisibility",
                    "Knock",
                    "Lesser Restoration",
                    "Locate Animals or Plants",
                    "Phantasmal Force",
                    "Silence",
                    "Sound Burst",
                    "Suggestion",
                    "Zone of Truth"
                ],
                [
                    "Aura of Invisibility",
                    "Dispel Magic",
                    "Plant Growth",
                    "Speak with Dead",
                    "Stinking Cloud"
                ],
                [
                    "Confusion",
                    "Dimension Door",
                    "Freedom of Movement",
                    "Polymorph"
                ],
                [
                    "Awaken",
                    "Dominate Person",
                    "Feeblemind",
                    "Hold Monster",
                    "Mass Cure Wounds",
                    "Raise Dead",
                    "Scrying",
                    "Seeming",
                    "Teleportation Circle",
                    "True Seeing"
                ]
            ],
            "name": "Bard Spells"
        },
        {
            "spells": [
                [
                    "Guidance",
                    "Light",
                    "Resistance",
                    "Sacred Flame",
                    "Spare the Dying",
                    "Thaumaturgy"
                ],
                [
                    "Bless",
                    "Cause Fear",
                    "Command",
                    "Create or Destroy Water",
                    "Cure Wounds",
                    "Detect Good and Evil",
                    "Detect Magic",
                    "Detect Poison and Disease",
                    "Healing Word",
                    "Inflict Wounds",
                    "Protection from Evil",
                    "Purify Food and Drink",
                    "Sanctuary",
                    "Shield of Faith"
                ],
                [
                    "Aid",
                    "Augury",
                    "Gentle Repose",
                    "Hold Person",
                    "Lesser Restoration",
                    "Prayer of Healing",
                    "Protection from Poison",
                    "Silence",
                    "Spiritual Weapon",
                    "Zone of Truth"
                ],
                [
                    "Animate Dead",
                    "Beacon of Hope",
                    "Create Food and Water",
                    "Daylight",
                    "Dispel Magic",
                    "Holy Vigor",
                    "Mass Healing Word",
                    "Prayer",
                    "Protection from Energy",
                    "Remove Curse",
                    "Speak with Dead",
                    "Water Walk"
                ],
                [
                    "Air Walk",
                    "Death Ward",
                    "Divination",
                    "Freedom of Movement",
                    "Guardian of Faith"
                ],
                [
                    "Commune",
                    "Flame Strike",
                    "Insect Plague",
                    "Mass Cure Wounds",
                    "Raise Dead",
                    "Scrying",
                    "True Seeing"
                ],
                [
                    "Banishment",
                    "Blade Barrier",
                    "Greater Dispel Magic",
                    "Harm",
                    "Heal",
                    "Planar Ally"
                ],
                [
                    "Destruction",
                    "Greater Restoration",
                    "Fire Storm",
                    "Holy Word",
                    "Plane Shift",
                    "Regenerate",
                    "Resurrection"
                ],
                [
                    "Antimagic Field",
                    "Earthquake",
                    "Holy Aura"
                ],
                [
                    "Astral Projection",
                    "Gate",
                    "Mass Heal",
                    "True Resurrection",
                    "Druidcraft",
                    "Fire Seeds",
                    "Guidance",
                    "Read Magic",
                    "Resistance",
                    "Shillelagh",
                    "Animal Friendship",
                    "Charm Person",
                    "Create or Destroy Water",
                    "Cure Wounds",
                    "Detect Magic",
                    "Detect Poison and Disease",
                    "Entangle",
                    "Faerie Fire",
                    "Fog Cloud",
                    "Goodberry",
                    "Gust of Wind",
                    "Healing Word",
                    "Longstrider",
                    "Purify Food and Drink",
                    "Speak with Animals",
                    "Thunderwave",
                    "Animal Messenger",
                    "Barkskin",
                    "Darkvision",
                    "Heat Metal",
                    "Flame Blade",
                    "Flaming Sphere",
                    "Hold Person",
                    "Lesser Restoration",
                    "Locate Animals or Plants",
                    "Moonbeam",
                    "Pass without Trace",
                    "Protection from Poison",
                    "Spike Growth",
                    "Call Lightning",
                    "Daylight",
                    "Dispel Magic",
                    "Elemental Mantle",
                    "Meld into Stone",
                    "Plant Growth",
                    "Protection from Energy",
                    "Sleet Storm",
                    "Water Breathing",
                    "Water Walk",
                    "Air Walk",
                    "Blight",
                    "Confusion",
                    "Dominate Beast",
                    "Freedom of Movement",
                    "Ice Storm",
                    "Polymorph",
                    "Stoneskin",
                    "Wall of Fire",
                    "Awaken",
                    "Commune",
                    "Feeblemind",
                    "Insect Plague",
                    "Mass Cure Wounds",
                    "Plant Door",
                    "Scrying",
                    "Wall of Stone",
                    "Heal",
                    "Move Earth",
                    "Sunbeam",
                    "Wall of Thorns",
                    "Wind Walk",
                    "Creeping Doom",
                    "Finger of Death",
                    "Fire Storm",
                    "Greater Restoration",
                    "Plane Shift",
                    "Regenerate",
                    "Earthquake",
                    "Sunburst",
                    "Foresight",
                    "Storm of Vengeance"
                ]
            ],
            "name": "Cleric Spells"
        },
        {
            "spells": [
                [
                    "Chill Touch",
                    "Dancing Lights",
                    "Light",
                    "Mage Hand",
                    "Mending",
                    "Message",
                    "Minor Illusion",
                    "Prestidigitation",
                    "Ray of Frost",
                    "Read Magic",
                    "Shocking Grasp"
                ],
                [
                    "Alarm",
                    "Burning Hands",
                    "Cause Fear",
                    "Charm Person",
                    "Color Spray",
                    "Comprehend Languages",
                    "Detect Magic",
                    "Disguise Self",
                    "False Life",
                    "Feather Fall",
                    "Find Familiar",
                    "Fog Cloud",
                    "Grease",
                    "Gust of Wind",
                    "Identify",
                    "Longstrider",
                    "Mage Armor",
                    "Magic Missile",
                    "Protection from Evil",
                    "Shield",
                    "Sleep",
                    "Thunderwave"
                ],
                [
                    "Arcane Lock",
                    "Blur",
                    "Darkness",
                    "Darkvision",
                    "Flaming Sphere",
                    "Gentle Repose",
                    "Hold Person",
                    "Invisibility",
                    "Knock",
                    "Levitate",
                    "Magic Weapon",
                    "Melf's Acid Arrow",
                    "Mirror Image",
                    "Ray of Enfeeblement",
                    "Phantasmal Force",
                    "Rope Trick",
                    "Scorching Ray",
                    "Sound Burst",
                    "Spider Climb",
                    "Suggestion",
                    "Web"
                ],
                [
                    "Animate Dead",
                    "Aura of Invisibility",
                    "Blink",
                    "Dispel Magic",
                    "Fireball",
                    "Fly",
                    "Haste",
                    "Lightning Bolt",
                    "Major Image",
                    "Protection from Energy",
                    "Remove Curse",
                    "Sleet Storm",
                    "Slow",
                    "Stinking Cloud",
                    "Water Breathing"
                ],
                [
                    "Arcane Eye",
                    "Blight",
                    "Confusion",
                    "Dimension Door",
                    "Evard's Black Tentacles",
                    "Ice Storm",
                    "Polymorph",
                    "Stoneskin",
                    "Wall of Fire"
                ],
                [
                    "Cloudkill",
                    "Cone of Cold",
                    "Contact Other Plane",
                    "Dominate Person",
                    "Feeblemind",
                    "Hold Monster",
                    "Passwall",
                    "Scrying",
                    "Seeming",
                    "Telekinesis",
                    "Teleportation Circle",
                    "True Seeing",
                    "Wall of Stone"
                ],
                [
                    "Arcane Gate",
                    "Banishment",
                    "Chain Lightning",
                    "Circle of Death",
                    "Disintegrate",
                    "Flesh to Stone",
                    "Greater Dispel Magic",
                    "Mass Suggestion",
                    "Move Earth",
                    "Sunbeam"
                ],
                [
                    "Etherealness",
                    "Finger of Death",
                    "Mass Invisibility",
                    "Mordenkainen's Sword",
                    "Plane Shift",
                    "Prismatic Spray",
                    "Teleport"
                ],
                [
                    "Antimagic Field",
                    "Clone",
                    "Dominate Monster",
                    "Maze",
                    "Otto's Irresistible Dance",
                    "Power Word Stun",
                    "Sunburst",
                    "Trap the Soul"
                ],
                [
                    "Astral Projection",
                    "Foresight",
                    "Gate",
                    "Mass Hold Monster",
                    "Meteor Swarm",
                    "Power Word Kill",
                    "Time Stop",
                    "Wish"
                ]
            ],
            "name": "Mage Spells"
        },
        {
            "spells": [
                null,
                [
                    "Bless",
                    "Command",
                    "Cure Wounds",
                    "Demand",
                    "Detect Magic",
                    "Detect Poison and Disease",
                    "Divine Favor",
                    "Protection from Evil",
                    "Purify Food and Drink",
                    "Searing Smite",
                    "Shield of Faith",
                    "Thunderous Smite",
                    "Wrathful Smite"
                ],
                [
                    "Aid",
                    "Branding Smite",
                    "Holy Accord",
                    "Lesser Restoration",
                    "Magic Weapon",
                    "Protection from Poison",
                    "Righteous Shield",
                    "Zone of Truth"
                ],
                [
                    "Aura of Vitality",
                    "Create Food and Water",
                    "Crusader's Mantle",
                    "Daylight",
                    "Dispel Magic",
                    "Elemental Weapon",
                    "Prayer",
                    "Remove Curse",
                    "Sunburst Smite"
                ],
                [
                    "Aura of Life",
                    "Aura of Purity",
                    "Death Ward",
                    "Divine Power"
                ],
                [
                    "Circle of Power",
                    "Damning Smite",
                    "Disintegrating Smite",
                    "Raise Dead",
                    "True Seeing",
                    "Alarm",
                    "Animal Friendship",
                    "Cure Wounds",
                    "Detect Magic",
                    "Detect Poison and Disease",
                    "Fog Cloud",
                    "Goodberry",
                    "Hail of Thorns",
                    "Hunter's Mark",
                    "Longstrider",
                    "Speak with Animals",
                    "Animal Messenger",
                    "Barkskin",
                    "Cordon of Arrows",
                    "Darkvision",
                    "Hunter's Veil",
                    "Lesser Restoration",
                    "Locate Animals or Plants",
                    "Pass without Trace",
                    "Protection from Poison",
                    "Silence",
                    "Spike Growth",
                    "Conjure Barrage",
                    "Daylight",
                    "Plant Growth",
                    "Protection from Energy",
                    "Water Breathing",
                    "Water Walk",
                    "Freedom of Movement",
                    "Grasping Vine",
                    "Commune",
                    "Conjure Volley",
                    "Swift Quiver"
                ]
            ],
            "name": "Paladin Spells"
        }
    ]
}
